{
    "0": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "kurt koenen",
        "reviewText": "Best E-reader I've owned This model no longer produced was happy to find this one!",
        "summary": "Very Good",
        "unixReviewTime": 1489104000,
        "vote": null,
        "index": 0,
        "summaKeyWords": [
            "e",
            "best",
            "longer produced"
        ],
        "sentiment": 0.7901
    },
    "1": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "APalma",
        "reviewText": "Easy to use and, after updating firmware to get rid of ghosting issues, great image quality.",
        "summary": "Must have reader",
        "unixReviewTime": 1485475200,
        "vote": null,
        "index": 1,
        "summaKeyWords": [
            "updating firmware",
            "issues great image",
            "ghosting"
        ],
        "sentiment": 0.7906
    },
    "2": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Mick",
        "reviewText": "Need to clean the screen when the touchscreen stops responding - otherwise perfect.",
        "summary": "... the screen when the touchscreen stops responding - otherwise perfect.",
        "unixReviewTime": 1485388800,
        "vote": null,
        "index": 2,
        "summaKeyWords": [
            "touchscreen stops"
        ],
        "sentiment": 0.7003
    },
    "3": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "David",
        "reviewText": "gift loved it",
        "summary": "Five Stars",
        "unixReviewTime": 1483228800,
        "vote": null,
        "index": 3,
        "summaKeyWords": [
            "gift"
        ],
        "sentiment": 0.7783
    },
    "4": {
        "overall": 4,
        "asin": "140053271X",
        "reviewerName": "Ed N",
        "reviewText": "If you want a top-line ereader, go with one of the Kindle ereaders.  However, if just a basic ereader will do, get a Nook Simple Touch. It's quite cheap now, plus it can last a long time between battery charges.  I've had a Nook ST for 3+ years, and it can get pretty close to a month between charges, depending on level of use.  Screen resolution is less than on more modern Kindle readers, and it is NOT back-lit, but otherwise, the Nook ST should handle all your basic ereading needs.  It is completely readable even in direct sunlight.  It's light and durable.  I have mine in a soft case to give it extra protection from accidental drops.\n\nThe best thing about the Nook is that it is rootable.  It only uses Android 2.1, so functionality is obviously limited, but once rooted, it can still read all Nook ebooks, plus you can install the Kindle app on it to read Kindle ebooks as well!  That's the best of both worlds, if you have separate books on your Nook or Amazon accounts and want to combine them all together in one device.  You can use a rooted Nook to access the internet via wifi, but keep in mind it uses e-ink, so it will be sluggish, even with Opera Browser installed.  Better to just use the Nook for reading books.",
        "summary": "The Nook Simple Touch is a great e-reader for basic reading needs!",
        "unixReviewTime": 1479168000,
        "vote": null,
        "index": 4,
        "summaKeyWords": [
            "kindle",
            "ereader",
            "ereaders",
            "ereading",
            "nook",
            "use",
            "uses",
            "ebooks",
            "charges",
            "browser",
            "install",
            "installed",
            "e",
            "simple",
            "read",
            "reading",
            "amazon accounts",
            "sunlight",
            "pretty close",
            "drops",
            "limited",
            "accidental",
            "direct",
            "soft case",
            "extra protection",
            "obviously",
            "best thing",
            "completely readable",
            "long time",
            "screen resolution",
            "separate books",
            "depending",
            "battery",
            "opera",
            "better",
            "android",
            "touch",
            "basic",
            "needs"
        ],
        "sentiment": 0.9493
    },
    "5": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "john",
        "reviewText": "good for what it is",
        "summary": "Five Stars",
        "unixReviewTime": 1477699200,
        "vote": null,
        "index": 5,
        "summaKeyWords": [],
        "sentiment": 0.4404
    },
    "6": {
        "overall": 4,
        "asin": "140053271X",
        "reviewerName": "RON",
        "reviewText": "I bought this one to replace an old one that stopped working.",
        "summary": "Four Stars",
        "unixReviewTime": 1475107200,
        "vote": null,
        "index": 6,
        "summaKeyWords": [
            "stopped"
        ],
        "sentiment": -0.2263
    },
    "7": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "BH",
        "reviewText": "I've had one of these for years now and love it. Got mine for only $39 right around the holidays on sale, so worth it. I have a Nook Color which is great but because of the glare I needed something to take to the beach\/pool without any glare issues. This works perfectly just like a real book in the sun, you'll feel as if you are looking at a paper page. I'll get down to the pros\/cons.\nPros: lightweight, small, simple, holds hundreds of books, only needs a charge 1-2x month, you can create shelves with books of your choosing.\nCons: only wifi capable, it is simply a reader for books (not great for magazines or anything in color), no web, checking emails, surfing, games etc.\n\nThis will work well for someone who simply wants to read, no frills. For me it's perfect. If you want more, get a tablet.\np.s if you like to read at night, get a book light or use the lamp old school style.",
        "summary": "Awesome and simple E-reader, No flare",
        "unixReviewTime": 1474848000,
        "vote": null,
        "index": 7,
        "summaKeyWords": [
            "nook",
            "color",
            "simply",
            "wants",
            "want",
            "glare",
            "issues",
            "emails",
            "page",
            "paper",
            "web checking",
            "surfing games",
            "lamp old school",
            "books",
            "style",
            "real book",
            "feel",
            "x",
            "light",
            "small",
            "pros",
            "lightweight",
            "cons",
            "simple holds",
            "tablet",
            "p",
            "beach",
            "capable",
            "wifi",
            "month",
            "charge",
            "choosing"
        ],
        "sentiment": 0.9884
    },
    "8": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Huels",
        "reviewText": "I was going to deploy to my third deployment to Iraq in 2011 and I wanted some way to read all my books. As you may know, space is precious when you're talking about military gear. We were very strict on what we could or could not bring on the deployment. Also I need something that could go a long time on a single charge. None of the full tablets were going to cut it and than I discovered the paper white. It claims that you can go several weeks on a single charge (or was it months) I can't remember since it's been son long. There were times on my last deployments where we went almost a month without any electricity. After a successful deployment I can defiantly say that this nook proved it was up to the task. I don't think I charged it more than twice and the second charge was just because I had the time and means. The tablet was also very well built. As you may know, Iraq has lots of sand. There were even a few times where I dropped the tablet in the sand. The device kept on trucking and did not give up.\n\nAfter my deployment I put it away in a drawer and forgot about it until I discovered it after I recently moved to my new town house. I would recommend this for anyone who want's a cheaper tablet for reading and does not mind not having sound or video. I currently have the finances and the means to get a much fancier and expensive tablet but I still love using my paper white. I do a lot of reading in the evening and I like how my eyes don't get strained from looking at a lit screen. I'm the type of person who can sit down and read for hours and hours.",
        "summary": "My story as a US soldier on a deployment",
        "unixReviewTime": 1474675200,
        "vote": 14.0,
        "index": 8,
        "summaKeyWords": [
            "deploy",
            "deployment",
            "deployments",
            "successful",
            "paper",
            "white",
            "nook proved",
            "lit",
            "screen",
            "gear",
            "military",
            "device kept",
            "recently moved",
            "tablets",
            "tablet",
            "know space",
            "long time",
            "new town",
            "defiantly say",
            "iraq",
            "son",
            "times",
            "house",
            "expensive"
        ],
        "sentiment": 0.9576
    },
    "9": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "John Orozco",
        "reviewText": "Very good reader for price and specifications",
        "summary": "all good",
        "unixReviewTime": 1474416000,
        "vote": null,
        "index": 9,
        "summaKeyWords": [
            "good"
        ],
        "sentiment": 0.4927
    },
    "10": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "rmib211",
        "reviewText": "This was purchased to replace an older, defective, Simple Touch reader. It performs well and I am very satisfied with it.",
        "summary": "It performs well and I am very satisfied with it",
        "unixReviewTime": 1472256000,
        "vote": null,
        "index": 10,
        "summaKeyWords": [
            "touch",
            "defective",
            "simple",
            "reader"
        ],
        "sentiment": 0.3167
    },
    "11": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Thomas V. Nash",
        "reviewText": "Bought two for gifts, recipients both rave about them",
        "summary": "Five Stars",
        "unixReviewTime": 1467158400,
        "vote": null,
        "index": 11,
        "summaKeyWords": [
            "gifts"
        ],
        "sentiment": 0.0
    },
    "12": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Al",
        "reviewText": "Great for travel and everywhere else really!",
        "summary": "Five Stars",
        "unixReviewTime": 1466985600,
        "vote": null,
        "index": 12,
        "summaKeyWords": [],
        "sentiment": 0.6588
    },
    "13": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Laozee",
        "reviewText": "great product, still have it..(bought it 3-4 years ago)",
        "summary": "Five Stars",
        "unixReviewTime": 1461024000,
        "vote": null,
        "index": 13,
        "summaKeyWords": [
            "product",
            "great",
            "ago"
        ],
        "sentiment": 0.6249
    },
    "14": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Ellen Hilderbrand",
        "reviewText": "good quality",
        "summary": "Five Stars",
        "unixReviewTime": 1457654400,
        "vote": null,
        "index": 14,
        "summaKeyWords": [
            "good"
        ],
        "sentiment": 0.4404
    },
    "15": {
        "overall": 3,
        "asin": "140053271X",
        "reviewerName": "Miguel H.",
        "reviewText": "nice",
        "summary": "Three Stars",
        "unixReviewTime": 1455408000,
        "vote": null,
        "index": 15,
        "summaKeyWords": [],
        "sentiment": 0.4215
    },
    "16": {
        "overall": 2,
        "asin": "140053271X",
        "reviewerName": "Purple bicycle",
        "reviewText": "This is replacing my Nook first edition (which in my opinion, is the best version by far) and while I like the size and feel of it, the operation leaves something to be desired. Page turns are not instantaneous and there is a weird, albeit brief flash of the screen every time I change pages. The page turn is actually faster on my first edition. I was also having issues with some books where I received an error when I tried to turn the page, almost like the page didn't exist. I would have to reset my nook, used the \"Go To\" function to skip to the page AFTER the one I wanted to read, and then go back a page just to pick up where I left off. And BN customer service is completely unhelpful when it comes to their slightly older e-readers, because everybody wants you to upgrade to their newest tablet editions with backlit screens. If I wanted to read books on a tablet, I would do that, but what I want is an e-ink ereader specifically for reading books. I have been a nook fan since the beginning and I still totally am. I really want to love this, but until BN works out their software issues, I just can't.",
        "summary": "Really wanted to love this.",
        "unixReviewTime": 1453939200,
        "vote": 4.0,
        "index": 16,
        "summaKeyWords": [
            "nook",
            "fan",
            "pages",
            "newest tablet editions",
            "edition",
            "page turns",
            "operation leaves",
            "desired",
            "change",
            "turn",
            "software",
            "issues",
            "actually faster",
            "completely unhelpful",
            "e",
            "bn customer service",
            "ereader specifically",
            "slightly older",
            "works",
            "backlit",
            "screen",
            "screens",
            "books",
            "read",
            "reading",
            "wanted",
            "want",
            "everybody wants",
            "albeit brief"
        ],
        "sentiment": 0.9382
    },
    "17": {
        "overall": 3,
        "asin": "140053271X",
        "reviewerName": "Nanue",
        "reviewText": "Gave as a gift and after a year I have NEVER seen it used. Partly because of the parents having to use a credit card number to order books and the problem of children ordering by mistake or losing it and someone else having a great time on their dime.",
        "summary": "Partly because of the parents having to use a credit card number to order books and the problem of children ordering by mistake",
        "unixReviewTime": 1446595200,
        "vote": null,
        "index": 17,
        "summaKeyWords": [
            "credit card number",
            "order books",
            "children ordering",
            "great"
        ],
        "sentiment": 0.4939
    },
    "18": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "MrMr",
        "reviewText": "I absolutely love the Simple Touch Reader by Nook.  I love the battery life, the simplicity and the size of the device.  I can go for weeks without charging it, I can download books within seconds.  The best part is the size and weight of the device.  I can hold it for hours and read without getting hand cramps.  I also love the e-ink display so much more than a back lit screen.  I have an iPad mini, an ipad 4 and several other devices but none of them can hold a candle to the Nook Simple Touch Reader.  It irritates me that Barnes and Noble doesn't actively sell them because in my opinion it's the best e-reader available.",
        "summary": "I absolutely love the Simple Touch Reader by Nook",
        "unixReviewTime": 1445904000,
        "vote": 2.0,
        "index": 18,
        "summaKeyWords": [
            "absolutely love",
            "download books",
            "actively sell",
            "getting hand",
            "life",
            "battery",
            "screen",
            "lit",
            "cramps",
            "mini",
            "ipad",
            "reader",
            "e",
            "simple",
            "touch",
            "nook"
        ],
        "sentiment": 0.9304
    },
    "19": {
        "overall": 3,
        "asin": "140053271X",
        "reviewerName": "Rebecca M.",
        "reviewText": "Bought this as a gift, and the lack of any light assistance seems to be unsatisfactory when reading at night or in a dim area.",
        "summary": "not satisfied",
        "unixReviewTime": 1444003200,
        "vote": null,
        "index": 19,
        "summaKeyWords": [
            "light assistance",
            "area"
        ],
        "sentiment": 0.1531
    },
    "20": {
        "overall": 4,
        "asin": "140053271X",
        "reviewerName": "Bubba-J",
        "reviewText": "Outstanding for the price.",
        "summary": "Four Stars",
        "unixReviewTime": 1442966400,
        "vote": null,
        "index": 20,
        "summaKeyWords": [],
        "sentiment": 0.6124
    },
    "21": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "H. Lockhart",
        "reviewText": "Works great so far, daughter loves it",
        "summary": "Five Stars",
        "unixReviewTime": 1440720000,
        "vote": null,
        "index": 21,
        "summaKeyWords": [
            "works great",
            "daughter loves"
        ],
        "sentiment": 0.8428
    },
    "22": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "G. Smietana",
        "reviewText": "Easy to download and easy to read. Hods a charge very well.",
        "summary": "Nice easy reader",
        "unixReviewTime": 1435536000,
        "vote": null,
        "index": 22,
        "summaKeyWords": [
            "read"
        ],
        "sentiment": 0.8016
    },
    "23": {
        "overall": 4,
        "asin": "140053271X",
        "reviewerName": "FountainPenDiva",
        "reviewText": "After nearly six years my first generation Nook finally gave out. It had been a steady and faithful (if slightly huge) companion and my first foray into the world of e-books. I tried using the Nook app for my Nexus 7 tablet but unlike the Kindle app, it was unwieldy and rather user-unfriendly. Not to mention needing the internet to actually READ the books I already bought. So I figured it was time to invest in another Nook--the Simple Touch.  No bells and whistles. Just a good, basic touchscreen e-reader with a very clear screen.  It's a fairly light little machine, weighs about the same as my Kindle. There are two aspects that makes Nook superior to Kindle: one is the expandable memory card slot. I've always liked the ability to add e-books from other vendors to my Nook. The second is the ability to customize screensavers.  Yes, it seems like such a minor thing, but I just like the personalization. I'm on Day Two of my new Nook and so far I like it.\n\nUpdate 6\/14\/15: So far, so good. The battery life is awesome. I do charge it every day but I really don't have to. I purchased a screen protector for it and am waiting for a cool decal skin and a case. I'm one who firmly believes in protecting their electronic gadgets.",
        "summary": "My New Nook",
        "unixReviewTime": 1433721600,
        "vote": 12.0,
        "index": 23,
        "summaKeyWords": [
            "nook finally gave",
            "app",
            "makes",
            "new",
            "superior",
            "generation",
            "kindle",
            "screensavers",
            "yes",
            "customize",
            "nexus",
            "tablet",
            "expandable memory card",
            "actually",
            "read",
            "slot",
            "mention needing",
            "huge companion",
            "battery life",
            "thing",
            "minor",
            "slightly",
            "e",
            "touch",
            "simple",
            "electronic",
            "gadgets",
            "good basic touchscreen",
            "firmly believes",
            "cool decal skin",
            "screen",
            "books",
            "add",
            "clear",
            "protector",
            "little"
        ],
        "sentiment": 0.9936
    },
    "24": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Susan A",
        "reviewText": "Using this for years.. As good as the fancy new ones!",
        "summary": "As good as the fancy new ones",
        "unixReviewTime": 1433548800,
        "vote": null,
        "index": 24,
        "summaKeyWords": [
            "fancy new"
        ],
        "sentiment": 0.4926
    },
    "25": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Michael Black Sr.",
        "reviewText": "Great product",
        "summary": "Great service",
        "unixReviewTime": 1433203200,
        "vote": null,
        "index": 25,
        "summaKeyWords": [
            "great"
        ],
        "sentiment": 0.6249
    },
    "26": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "El gallo 13",
        "reviewText": "Great for novels, not so great for non-fiction with photos and charts.  Does almost everything well. Compact, keeps a charge for 30 days or so.  The feel of it, the look of it.  It is special.",
        "summary": "As good as a book",
        "unixReviewTime": 1432857600,
        "vote": null,
        "index": 26,
        "summaKeyWords": [
            "non",
            "keeps"
        ],
        "sentiment": 0.5397
    },
    "27": {
        "overall": 4,
        "asin": "140053271X",
        "reviewerName": "G Browne",
        "reviewText": "I realise that B&N are getting rid of their own Nooks and are passing the baton to Samsung, so these older Nooks are being sold off very cheaply. I particularly like that it will take a uSD card on which I have many other e-books and pdf books, which can be read with the Nook. Apart from that, it works well, has a good screen, although probably without all the latest bells and whistles. I bought this to replace a very slow 1st generation e-book reader whose e-ink screen is not nearly as good as that on the Nook.",
        "summary": "An old model but still works well and is a pleasure to use.",
        "unixReviewTime": 1432857600,
        "vote": 2.0,
        "index": 27,
        "summaKeyWords": [
            "b",
            "usd card",
            "nooks",
            "nook",
            "getting rid",
            "apart",
            "older",
            "e",
            "books",
            "particularly like",
            "screen",
            "st generation",
            "good",
            "slow",
            "reader"
        ],
        "sentiment": 0.8737
    },
    "28": {
        "overall": 4,
        "asin": "140053271X",
        "reviewerName": "christopher e boone",
        "reviewText": "Very good and portable reader, easy to see with different fonts to choose from and very easy to hold especially when placed in protective cover",
        "summary": "Very good and portable reader",
        "unixReviewTime": 1432166400,
        "vote": null,
        "index": 28,
        "summaKeyWords": [
            "reader easy",
            "portable",
            "different fonts",
            "cover",
            "hold"
        ],
        "sentiment": 0.8399
    },
    "29": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "JoeESP9",
        "reviewText": "For the price I paid this was IMO a steal. I have ~60 books on it. The battery life is excellent and it's viewable even in the brightest sunlight.",
        "summary": "Like it!",
        "unixReviewTime": 1431475200,
        "vote": null,
        "index": 29,
        "summaKeyWords": [
            "battery life",
            "sunlight"
        ],
        "sentiment": 0.6705
    },
    "30": {
        "overall": 4,
        "asin": "140053271X",
        "reviewerName": "Andres Castaneda",
        "reviewText": "Bought this when it was 34 dlls but I think they went a little high on the price since then...",
        "summary": "too expensive now.",
        "unixReviewTime": 1431388800,
        "vote": null,
        "index": 30,
        "summaKeyWords": [
            "little"
        ],
        "sentiment": 0.0
    },
    "31": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "cgaribay",
        "reviewText": "Love it, accurate with description and expectation.",
        "summary": "Five Stars",
        "unixReviewTime": 1430697600,
        "vote": null,
        "index": 31,
        "summaKeyWords": [],
        "sentiment": 0.6369
    },
    "32": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "David",
        "reviewText": "I'm one of those readers that loves buying physical books and who has avoided e-readers and e-books for as long as I could. I got my nook as a hand-me-down from my girlfriend's father who bought it and almost immediately realized he had no use for it. It's been sitting around the house for about two years now, getting extremely occasional use. Recently I've found myself in a situation where I have to purchase e-books regularly because many of my favorite authors are releasing novellas or short story collections without print versions, and this has come in extremely handy.\n\nNow that I've been using it more, I have to say I'm incredibly impressed by how well this technology that was designed in 2011 holds up today. I have zero complaints about it, hardware or software. I doubt I'll feel even the slightest urge to purchase a newer e-reader until this one bites the dust. The text is clear and crisp. The device itself is lightweight, feels good in the hand, and is pretty much the exact size and shape I would want--not too big, not too small.\n\nThe software works perfectly for how I use it. The touchscreen works better than you'd expect. I've had no issues typing on it in the rare cases where I do need to type, and everything is simple to navigate. One minor touch I love is that when the device sleeps or when you lock it the screen shows a classy black and white drawing of a famous author. I'm sure the Kindle has something similar.\n\nOne thing people might be frustrated by is that you can't just buy a book off Amazon and have it automatically sync over wifi or whispernet like you can with a Kindle. For me, that's not a problem. I rarely buy e-books. Usually, like I said, it's a new novella from a favored author which doesn't happen that frequently. Otherwise it's typically books I got from a humble e-book bundle. Since Amazon wouldn't automatically sync those to a kindle even if I had one, I've settled into using calibri to manage my e-book library and transfer over usb to my nook with the proper metadata and in the proper format (calibri can convert anything to anything and keeps the original intact). For those wondering, you CAN buy the kindle version of an e-book on amazon and get it on your nook using calibri fairly easily. There are guides out there that spell it all out, so just google it.",
        "summary": "Does Everything I Need",
        "unixReviewTime": 1429315200,
        "vote": null,
        "index": 32,
        "summaKeyWords": [
            "e",
            "book",
            "buying physical books",
            "author",
            "feel",
            "buy",
            "works perfectly",
            "versions",
            "version",
            "favorite authors",
            "use",
            "fairly",
            "getting extremely occasional",
            "format",
            "calibri",
            "releasing novellas",
            "new novella",
            "lightweight feels good",
            "rarely",
            "usually",
            "settled",
            "automatically sync",
            "classy black",
            "zero complaints",
            "original",
            "intact",
            "slightest urge",
            "expect",
            "screen shows",
            "device",
            "exact size",
            "thing people",
            "sleeps",
            "minor touch",
            "white drawing",
            "amazon",
            "wouldn",
            "issues typing",
            "immediately realized",
            "type",
            "short story collections",
            "incredibly impressed",
            "proper metadata",
            "whispernet like",
            "rare cases",
            "kindle",
            "print",
            "sure",
            "famous",
            "favored",
            "recently",
            "easily",
            "better",
            "software",
            "touchscreen",
            "handy",
            "avoided"
        ],
        "sentiment": 0.9912
    },
    "33": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Vickie Dixon",
        "reviewText": "great product",
        "summary": "Five Stars",
        "unixReviewTime": 1428537600,
        "vote": null,
        "index": 33,
        "summaKeyWords": [
            "great"
        ],
        "sentiment": 0.6249
    },
    "34": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "K. Mellott",
        "reviewText": "Great product.  I didn't think I would like one of these ereaders as I love turning pages but this is really great to read with.",
        "summary": "Great product. I didn't think I would like one ...",
        "unixReviewTime": 1428278400,
        "vote": null,
        "index": 34,
        "summaKeyWords": [
            "product",
            "great",
            "turning pages"
        ],
        "sentiment": 0.893
    },
    "35": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "s55623i",
        "reviewText": "Works great. I love the e-ink screen, its so much easier to read on than my ipad.",
        "summary": "Great",
        "unixReviewTime": 1426809600,
        "vote": null,
        "index": 35,
        "summaKeyWords": [
            "great",
            "works",
            "screen"
        ],
        "sentiment": 0.9077
    },
    "36": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "B. Crawley",
        "reviewText": "I lost my original Nook so looked at Barnes & Noble for a replacement. Now they don't stock this model, so bought it here. It has an SD card slot which I wanted & the newer model from B&N doesn't have.",
        "summary": "I lost my original Nook so looked at Barnes & ...",
        "unixReviewTime": 1424995200,
        "vote": null,
        "index": 36,
        "summaKeyWords": [
            "card",
            "barnes",
            "noble",
            "model",
            "newer",
            "original",
            "nook",
            "b"
        ],
        "sentiment": 0.4588
    },
    "37": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Steven",
        "reviewText": "I carry this with me everywhere. It lasts FOREVER. The battery literally lasts a month. I use it to read fanfiction primarily and upload all of my stories. Just a warning, unless you root the device it's basically useless. It would not let me put any fanfiction I downloaded on it until I rooted it. Even now, I can see the cover photos but no descriptions because it was designed to only read B&N books. I found ways around this by just clicking on the book and having the summary the main page, but it's still annoying.\n\nStill a must for any reader.",
        "summary": "unless you root the device it's basically useless. It would not let me put any fanfiction ...",
        "unixReviewTime": 1424822400,
        "vote": null,
        "index": 37,
        "summaKeyWords": [
            "lasts",
            "battery literally",
            "forever",
            "basically",
            "useless",
            "cover photos",
            "b",
            "read fanfiction",
            "main",
            "page"
        ],
        "sentiment": -0.8381
    },
    "38": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Steven C Bitowf",
        "reviewText": "Awesome!",
        "summary": "Christmas gift.",
        "unixReviewTime": 1424563200,
        "vote": null,
        "index": 38,
        "summaKeyWords": [],
        "sentiment": 0.6588
    },
    "39": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Jim",
        "reviewText": "good product and seller",
        "summary": "good product and seller",
        "unixReviewTime": 1423958400,
        "vote": null,
        "index": 39,
        "summaKeyWords": [
            "good"
        ],
        "sentiment": 0.4404
    },
    "40": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "johnu",
        "reviewText": "I bought this because my older nook battery is slowing down, and I love the nook.  You cannot easily buy a new battery, but I could\nstill buy one of the original nooks.  No-brainer.",
        "summary": "and I love the nook",
        "unixReviewTime": 1423872000,
        "vote": 2.0,
        "index": 40,
        "summaKeyWords": [
            "nooks",
            "nook battery",
            "easily buy",
            "new",
            "original"
        ],
        "sentiment": 0.6164
    },
    "41": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Triple L",
        "reviewText": "Enjoy using it, very easy to read.",
        "summary": "Five Stars",
        "unixReviewTime": 1421280000,
        "vote": null,
        "index": 41,
        "summaKeyWords": [],
        "sentiment": 0.7501
    },
    "42": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Masha Priest",
        "reviewText": "Kind of felt bad buying the competitors product on Amazon, but it's a great little device. Without the backlight, the battery lasts forever!",
        "summary": "Kind of felt bad buying the competitors product on Amazon",
        "unixReviewTime": 1419811200,
        "vote": null,
        "index": 42,
        "summaKeyWords": [
            "felt bad buying",
            "battery lasts",
            "forever",
            "great little",
            "device"
        ],
        "sentiment": 0.722
    },
    "43": {
        "overall": 4,
        "asin": "140053271X",
        "reviewerName": "Sandra Smith",
        "reviewText": "It's okay even tho I don't have it. It just looks really weird",
        "summary": "Four Stars",
        "unixReviewTime": 1419465600,
        "vote": null,
        "index": 43,
        "summaKeyWords": [],
        "sentiment": -0.024
    },
    "44": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "V Z W",
        "reviewText": "I could not be happier with the Nook Simple Touch. The e-ink is refreshing, considering I live and work with backlit computer screens - it is nice to turn this ln and read before bed and give my eyes a break. Known issues aside, this is a great product!",
        "summary": "Fantastic.",
        "unixReviewTime": 1418428800,
        "vote": null,
        "index": 44,
        "summaKeyWords": [
            "simple",
            "nook",
            "touch",
            "product",
            "great",
            "e",
            "refreshing considering",
            "known issues"
        ],
        "sentiment": 0.6615
    },
    "45": {
        "overall": 4,
        "asin": "140053271X",
        "reviewerName": "MXP",
        "reviewText": "While the B&N reader ecosystem seems a little moribund, I need to say that I love the NST I bought for our family. We also have Kindle and other Android devices so I have things to compare it with. For its main purpose, i.e. reading, it's just about perfect. Holds battery charge well. If you need more functionality, browsing, gaming, multimedia etc, it won't work for you (as it was not intended to).",
        "summary": "Simple and efficient",
        "unixReviewTime": 1416960000,
        "vote": null,
        "index": 45,
        "summaKeyWords": [
            "b reader ecosystem",
            "little",
            "moribund",
            "purpose",
            "main",
            "browsing",
            "android devices",
            "holds battery",
            "gaming multimedia",
            "functionality"
        ],
        "sentiment": 0.875
    },
    "46": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Rob M.",
        "reviewText": "At the time, this was the ereader with the best touch screen, side page-turning buttons, a nice contoured design that made it easy to hold, etc.  I had this ereader for a couple years until I switched to the Kindle Paperwhite.  The Nook Glowlight was my first choice, but the backlight on the screen was super faulty.  I still shop at barnes and noble for all my paperback books rather than amazon, and like bookstores, but I'm no longer on the Nook train.",
        "summary": "Great eReader",
        "unixReviewTime": 1416009600,
        "vote": null,
        "index": 46,
        "summaKeyWords": [
            "best touch",
            "screen",
            "nice contoured design",
            "faulty",
            "super",
            "kindle",
            "paperwhite",
            "like",
            "bookstores",
            "nook",
            "couple years",
            "train",
            "glowlight",
            "page"
        ],
        "sentiment": 0.9366
    },
    "47": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "NJMugglemom56",
        "reviewText": "Loved mine so much, bought one for my friend.....now, we trade (or borrow) books from each other 2000 miles away from each other.  She had stopped reading regular books because the print was too small (phenominom that happens as you get older (lol) I told her she could make the fonts larger than life with the Nook.... The very first book she read was one that she borrowed from me.  When I talked to her the day after she got her Nook, she told me she had already read half of the book......Thanks to Nook, we are all reading more.",
        "summary": "Loved mine so much",
        "unixReviewTime": 1414886400,
        "vote": null,
        "index": 47,
        "summaKeyWords": [
            "read",
            "book",
            "stopped reading regular",
            "borrow books",
            "half",
            "borrowed",
            "phenominom",
            "small",
            "miles away",
            "fonts larger"
        ],
        "sentiment": 0.4588
    },
    "48": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "John McLeod",
        "reviewText": "I love the Nook Simple Touch, and got this as a spare when I found out Nook is no longer making them.",
        "summary": "If you like this e-reader, get one quick (Nook has stopped making this model).",
        "unixReviewTime": 1414540800,
        "vote": null,
        "index": 48,
        "summaKeyWords": [
            "simple",
            "nook",
            "touch",
            "longer"
        ],
        "sentiment": 0.4588
    },
    "49": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Sam",
        "reviewText": "The battery lasts much longer, too. I had mine at 100% charged and it lasted for about twelve hours of playing time (with the brightness turned to low). I have the Netflix app and I can watch the videos perfectly. It's crystal clear.",
        "summary": "I have the Netflix app and I canwatch the videos perfectly",
        "unixReviewTime": 1413676800,
        "vote": null,
        "index": 49,
        "summaKeyWords": [
            "lasted",
            "battery lasts",
            "perfectly",
            "videos",
            "clear",
            "crystal",
            "playing time",
            "brightness turned"
        ],
        "sentiment": 0.8555
    },
    "50": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Arthur Shrader",
        "reviewText": "GREAT!!!!",
        "summary": "Five Stars",
        "unixReviewTime": 1412208000,
        "vote": null,
        "index": 50,
        "summaKeyWords": [],
        "sentiment": 0.0
    },
    "51": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "D. Jones",
        "reviewText": "Excellent little Reader!  No glare, easy on the eyes, very functional.  Why pay more for another brand when this does the job excellently!  I highly recommend.",
        "summary": "Excellent little Reader",
        "unixReviewTime": 1411776000,
        "vote": null,
        "index": 51,
        "summaKeyWords": [
            "excellently",
            "excellent little",
            "job",
            "reader",
            "glare easy",
            "recommend"
        ],
        "sentiment": 0.9098
    },
    "52": {
        "overall": 4,
        "asin": "140053271X",
        "reviewerName": "John Drennen",
        "reviewText": "Great value for my purpose to store and read PDF instructional files.  I use my Kindle for pleasure reading. Good Value and was shipped quickly ... could not find this model (basic) in the store.  Offers detachable micro sd storage chips and Kindle doesn't and that is the only reason I choose this product. I personally recommend the Kindle ... but this was a good value.",
        "summary": "Great value for my purpose to store and read PDF ...",
        "unixReviewTime": 1409616000,
        "vote": 2.0,
        "index": 52,
        "summaKeyWords": [
            "read",
            "reading",
            "pleasure",
            "great value",
            "files",
            "pdf instructional",
            "good",
            "basic",
            "sd storage chips",
            "shipped quickly",
            "model",
            "personally",
            "offers detachable"
        ],
        "sentiment": 0.9428
    },
    "53": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Howard S. Shubs",
        "reviewText": "Fantastic device!  Easy to use, simple to carry.  Does exactly what it says on the box.  Mounts w\/o any strangeness right on the desktop so you can move epub files on and off it as you wish, with no additional software.  Love it.",
        "summary": "Best and simplest e-reader.",
        "unixReviewTime": 1409443200,
        "vote": null,
        "index": 53,
        "summaKeyWords": [
            "device",
            "fantastic",
            "easy",
            "use simple",
            "software",
            "mounts",
            "w",
            "love",
            "additional",
            "epub files",
            "box"
        ],
        "sentiment": 0.9098
    },
    "54": {
        "overall": 3,
        "asin": "140053271X",
        "reviewerName": "Helen R. Villaruel",
        "reviewText": "Manual but user friendly..function as expected to a reader..much easier to navigate than the manual kindle",
        "summary": "Manual but user friendly.. function as expected to ...",
        "unixReviewTime": 1407715200,
        "vote": null,
        "index": 54,
        "summaKeyWords": [
            "friendly",
            "kindle",
            "manual",
            "user"
        ],
        "sentiment": 0.5719
    },
    "55": {
        "overall": 4,
        "asin": "140053271X",
        "reviewerName": "James G.",
        "reviewText": "it's a limited device, but it fulfills its purpose very well.  Most of all, what I most wanted, it is great in bright sun. It's an e-book reader, and it performs very well as just that.",
        "summary": "Performs well -- fulfills its purpose.",
        "unixReviewTime": 1406678400,
        "vote": 2.0,
        "index": 55,
        "summaKeyWords": [
            "device",
            "limited",
            "bright",
            "sun",
            "e"
        ],
        "sentiment": 0.9567
    },
    "56": {
        "overall": 1,
        "asin": "140053271X",
        "reviewerName": "J. Fox",
        "reviewText": "This turned out to be a demo unit from Barnes and Noble and would only work in demo mode.  Useless as a reader.",
        "summary": "ULTRA FAIL",
        "unixReviewTime": 1406246400,
        "vote": null,
        "index": 56,
        "summaKeyWords": [
            "mode",
            "demo unit"
        ],
        "sentiment": 0.0516
    },
    "57": {
        "overall": 1,
        "asin": "140053271X",
        "reviewerName": "Curlznmyhair",
        "reviewText": "Hated this, I returned it. Slow transition between screens and it flickered, became motion sick with watching the screen.",
        "summary": "One Star",
        "unixReviewTime": 1405296000,
        "vote": null,
        "index": 57,
        "summaKeyWords": [
            "slow transition",
            "sick"
        ],
        "sentiment": -0.8176
    },
    "58": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Requiem",
        "reviewText": "I love the B&N Nook Simple Touch.  I can't compare it to the Amazon Paperwhite, because I refuse to try one.  The Nook has expandable memory (which I do not believe the Paperwhite does).  Up to 32GB, which means I can save around 32,000 books.  If, for some reason, I need more space, then I can just drop another 15-20 bucks, and have another 32GB (though I will have my collection split over two memory cards).  I also like that B&N accepts ePub, which is pretty much the universal standard, whereas Amazon locks you into their own store.  This means that you can shop Sony's store with a Nook, and Nook's store with a Sony, but Amazon can't access either of those stores.\n\nThe downside to this is that, as of now, Amazon books tend to be cheaper than any other e-reader store.  However, all the ebooks are usually within a dollar or two, and I like having the freedom to go and purchase e books from multiple stores, instead of just being locked into one.\n\nThis is NOT a tablet, and as such, you can't surf the web, download apps, or play games.  What you CAN do is eliminate the tens, if not hundreds, of pounds of books that sit on your bookshelf.",
        "summary": "It is great if you know what you are in for",
        "unixReviewTime": 1405296000,
        "vote": 3.0,
        "index": 58,
        "summaKeyWords": [
            "simple",
            "nook",
            "accepts",
            "touch",
            "b",
            "epub",
            "store",
            "stores",
            "e",
            "books",
            "amazon",
            "shop",
            "sony",
            "expandable memory",
            "collection split",
            "cards",
            "multiple",
            "instead",
            "purchase",
            "tend",
            "locks",
            "locked",
            "paperwhite",
            "games",
            "play",
            "standard"
        ],
        "sentiment": 0.9661
    },
    "59": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Cecelia T. Taylor",
        "reviewText": "This device is small enough to fit in my purse , so it is always handy for that long bus ride home and for reading on those nights when I can't seem to sleep.",
        "summary": "Reading is wonderful!",
        "unixReviewTime": 1403827200,
        "vote": null,
        "index": 59,
        "summaKeyWords": [
            "bus ride home"
        ],
        "sentiment": 0.3612
    },
    "60": {
        "overall": 1,
        "asin": "140053271X",
        "reviewerName": "JuanCarlosGomez",
        "reviewText": "I don't know why I bought this tablet, just only one day using it and I stored it in a place where it continues stored... I don't like the screen... it reflects light from many sources (sun, bulbs, etc) despite the type of technology used in the screen...the size is no convenient, I think a bigger one good be better... well, this is my opinion about this product...",
        "summary": "Barnes & Noble Nook Simple Touch eBook Reader (Wi-Fi Only)",
        "unixReviewTime": 1401148800,
        "vote": null,
        "index": 60,
        "summaKeyWords": [
            "continues",
            "stored",
            "reflects light",
            "sun",
            "sources"
        ],
        "sentiment": 0.1754
    },
    "61": {
        "overall": 4,
        "asin": "140053271X",
        "reviewerName": "R. Eifler",
        "reviewText": "This is a sold update to the older nook, but gez you have to hit the webs just to find out you need to charge it OVERNIGHT in a WALL PLUG only before first usage AND that it MUST be turned on before trying to connect to windows.  Now knowing these two VERY IMPORTANT points, I can enjoy my \"Nook 2\".",
        "summary": "Weird anomalies",
        "unixReviewTime": 1398297600,
        "vote": null,
        "index": 61,
        "summaKeyWords": [
            "sold update",
            "older",
            "nook",
            "important",
            "points",
            "plug"
        ],
        "sentiment": 0.879
    },
    "62": {
        "overall": 1,
        "asin": "140053271X",
        "reviewerName": "Russ",
        "reviewText": "I got this as a  birthday gift from my kids. I was really excited to get a reader but because of some diabetic retinopathy I couldn't read it well. I need something with a backlight. I tried to take it back to Barnes and Noble to purchase a more expensive one that I could use but as always they were not willing to help me. They are the worst at customer service I have ever seen. I won't buy anything from them ever again. They are just unwilling to help. They always have a very lame excuse. I've asked my kids not to buy anything for me from them every again. I sure won't. This NOOK is of no use to me at all, it's not easy to use or easy to read and I just wanted to trade it in, pay more for something I could use but they said sense I had opened the package and tried to use it that I could not return it. Now I have a NOOK that is of know value at all to me and a store that is unwilling to help me in any way even though I had a receipt and an unused product. I will buy product from Amazon because they are so good to support their customers but I won't buy any product that is a Barnes and Noble. product at all.",
        "summary": "Simple touch Reader is not one that I can use",
        "unixReviewTime": 1394150400,
        "vote": 3.0,
        "index": 62,
        "summaKeyWords": [
            "birthday gift",
            "product",
            "customers",
            "customer service",
            "noble",
            "unused",
            "won buy",
            "know value",
            "sure",
            "diabetic retinopathy",
            "asked",
            "said sense"
        ],
        "sentiment": -0.12
    },
    "63": {
        "overall": 2,
        "asin": "140053271X",
        "reviewerName": "RM",
        "reviewText": "My Kindle broke and I replaced it with an extremely cheap Nook.  Since then I have been extremely disappointed.  I only expect three things out of an e-reader and was shocked to learn that the Nook fails on two of the three counts.\n\n1. The actual reading:\nThey both do the job.  In fact, I slightly prefer the Nook to the Kindle in terms of form, ease of reading, and the presence of a physical button.\n\n2. Wifi Connectivity:\nWhat the **** is the point of having wifi if you can only use it for downloading purchases from B&N.  I expect to practically NEVER make a purchase from the official store.  Instead I use an e-reader for my personal files (textbooks and news articles for example) and am left having to connect the device to my computer every. single. time.  Unbelievable shortcoming of the Nook.\n\n3. Software\nI can't see how far I've read, I can't edit file names, AND WORST OF ALL I CAN'T DELETE???????????!!?!!?!?!!?!  wtf B&N, wtf.\n\nThis product is really just awful in comparison.  Annoying to say b\/c I was unhappy with Amazon in relation to what happened to my Kindle.\n\nTwo stars because it does actually work, but that seems a bit generous...",
        "summary": "Scoreboard: Nook 1, Kindle 3",
        "unixReviewTime": 1391904000,
        "vote": 3.0,
        "index": 63,
        "summaKeyWords": [
            "kindle broke",
            "nook",
            "extremely cheap",
            "software",
            "disappointed",
            "fails",
            "form ease",
            "e",
            "time",
            "unbelievable shortcoming",
            "wifi",
            "button",
            "slightly prefer",
            "single",
            "bit",
            "generous",
            "connectivity",
            "connect",
            "physical",
            "store",
            "news articles",
            "actual",
            "actually",
            "reading",
            "read",
            "annoying",
            "comparison",
            "instead",
            "official",
            "downloading purchases",
            "purchase",
            "work",
            "edit file",
            "personal files",
            "textbooks",
            "names",
            "b"
        ],
        "sentiment": -0.8752
    },
    "64": {
        "overall": 2,
        "asin": "140053271X",
        "reviewerName": "Brian Engle",
        "reviewText": "OK, I got this thing and plugged it in as instructed, to which it responded by doing Nothing.  After some further research, I found that it likes to be updated.  I followed the instructions on the Nook website and downloaded the newest version and ... Nothing.  The little monster came back just as dumb as before.  It does show cute screens, but not yet anything productive.  So far, Not Impressed.",
        "summary": "So far, Not Impressed",
        "unixReviewTime": 1390176000,
        "vote": null,
        "index": 64,
        "summaKeyWords": [
            "nook website",
            "newest version",
            "little monster came",
            "cute"
        ],
        "sentiment": -0.2524
    },
    "65": {
        "overall": 3,
        "asin": "140053271X",
        "reviewerName": "Lisa ThayerVanDyke",
        "reviewText": "This arrived as described, packaged well, and worked well. The only issue I have ever had with them is its not as user friendly as it could be. I had to go to online blogs to find the rest of the steps to download an eBook. Whether it was from Barnes and Noble or the library.",
        "summary": "Recommended for 1st eBook",
        "unixReviewTime": 1389744000,
        "vote": null,
        "index": 65,
        "summaKeyWords": [
            "described packaged",
            "online blogs",
            "friendly"
        ],
        "sentiment": 0.5532
    },
    "66": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "William Bartko",
        "reviewText": "Out of the box she knew how to operate it, and is working fine getting a lot of use as she likes reading.  Glad to see as she is only 8 years old.\n\nBill",
        "summary": "Excellent Christmas gift to grandaughter",
        "unixReviewTime": 1388102400,
        "vote": null,
        "index": 66,
        "summaKeyWords": [
            "working fine getting",
            "reading",
            "glad",
            "likes",
            "old"
        ],
        "sentiment": 0.765
    },
    "67": {
        "overall": 3,
        "asin": "140053271X",
        "reviewerName": "EugeneNJ",
        "reviewText": "Inside 9 months one button broke, another flips several pages when you pres it once, and, finally, it froze on me for good the other day. I'm getting it replaced under warranty, but I should've gone with another brand.",
        "summary": "Breaks a lot.",
        "unixReviewTime": 1386115200,
        "vote": null,
        "index": 67,
        "summaKeyWords": [
            "months",
            "inside",
            "button",
            "broke",
            "gone",
            "getting"
        ],
        "sentiment": 0.0129
    },
    "68": {
        "overall": 2,
        "asin": "140053271X",
        "reviewerName": "JB",
        "reviewText": "Very disappointed in purchasing 2 of these, one for my wife and one for myself. We learned a couple months after purchasing different books on both devices that we could only loan the book out to the other device one time only for a 14 day period. Both of us typically read over lunch breaks and it takes longer than that to finish a book. Yes I do realize that we can just trade nooks back and forth though for the price of a ebook and the actual book I would rather purchase a hard copy of the book.",
        "summary": "Shame not allowing to loan out for longer period.",
        "unixReviewTime": 1385164800,
        "vote": null,
        "index": 68,
        "summaKeyWords": [
            "book",
            "different books",
            "couple months",
            "typically read",
            "hard copy",
            "day",
            "period",
            "lunch breaks",
            "takes longer",
            "trade nooks",
            "purchasing",
            "purchase"
        ],
        "sentiment": -0.2716
    },
    "69": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Thomas Hopper",
        "reviewText": "Readability in Sunlight is super even when the sun is directly hitting the screen; can't be beat! The blacks are great and the contrasting white whites really helps these old eyes of mine! I like the Android operation too.",
        "summary": "Nook Simple Touch",
        "unixReviewTime": 1384819200,
        "vote": null,
        "index": 69,
        "summaKeyWords": [
            "directly hitting",
            "android operation",
            "old eyes",
            "white whites"
        ],
        "sentiment": 0.9322
    },
    "70": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "HikerBob",
        "reviewText": "very very good value for this reader, and I am grateful for the quick exchange they made when the first unit developed a problem right away.  They immediately sent a replacement.  Immediately.",
        "summary": "great value",
        "unixReviewTime": 1384646400,
        "vote": null,
        "index": 70,
        "summaKeyWords": [
            "good value",
            "quick exchange",
            "immediately sent",
            "replacement",
            "right",
            "unit developed"
        ],
        "sentiment": 0.7726
    },
    "71": {
        "overall": 4,
        "asin": "140053271X",
        "reviewerName": "L. Kabel",
        "reviewText": "I previously owned a Kindle and loved it, but it kept breaking.  I finally gave up in frustration after having it replaced 3 times in the first year.\n\nI bought the Nook Simple Touch to replace it, and am very satisfied with my purchase.\n\nTo be honest, the Kindle is brighter and easier to read in less-than-perfect light.  However the Nook excels in nearly every other way.\n\n1) Nook is sturdily reliable.  I have had no failures with it whatsoever, although I carry it everywhere and use it daily.  I do have it in a protective case, but I had my Kindle in a protective case and it kept breaking anyway.  POINT:  NOOK.\n\n2) Nook Simple touch is smaller and lighter than the equivalent Kindle e-reader.  Nevertheless, screen-size is ample.\n\n3) Nook is responsive and seems faster at turning pages than Kindle.\n\n4) Books download in a blink and are immediately available.  This too seems faster than with my Kindle.\n\n5) There are some things I could do with my Kindle that I can't do with my Nook Simple Touch, but I don't miss those things.  I needed a simple e-reader that just plain works and Nook Simple Touch satisfies that need in a very inexpensive way WITHOUT ADS.  POINT: NOOK.\n\nGenerally, if you are shopping for an inexpensive, simple e-reader, I strongly urge you to buy the Nook, and not the Kindle.  I have tried both, and prefer the Nook.",
        "summary": "Less fragile than the Kindle. Convenient.",
        "unixReviewTime": 1384300800,
        "vote": 2.0,
        "index": 71,
        "summaKeyWords": [
            "nook",
            "simple",
            "kindle",
            "e",
            "protective",
            "strongly urge",
            "plain works",
            "case",
            "available",
            "turning pages",
            "immediately",
            "screen",
            "reliable",
            "sturdily",
            "replaced",
            "replace",
            "light",
            "finally gave",
            "breaking",
            "kept",
            "times",
            "previously owned",
            "touch",
            "point",
            "books download",
            "inexpensive",
            "way",
            "equivalent",
            "satisfied",
            "satisfies"
        ],
        "sentiment": 0.9726
    },
    "72": {
        "overall": 1,
        "asin": "140053271X",
        "reviewerName": "CLPhoto",
        "reviewText": "We bought one of these for my mother-in-law hoping to get her a piece of technology that would be enjoyable for her to use. It has been nothing but a pain. Her main thing she uses it for is reading books from the library. This requires a process that involves going through hoops, a computer, and an Adobe ID and software. Having experience with an Amazon Kindle (the very basic one) and iPads with library books, this was an absolute pain and I feel bad for my in-laws. What should be a two-five step process is way more complex and requires special software on the computer to transfer the ebook to the nook. There have been several occasions where my father-in-law (who is ok with technology) has called up and spent hours on the phone with my husband trying to figure out how to get a book onto the nook.\n\nI would not recommend this unless you plan to purchase only from the Nook itself. Otherwise, it is nothing but frustrating.",
        "summary": "Difficult if your main plan is to read library books!",
        "unixReviewTime": 1383177600,
        "vote": 3.0,
        "index": 72,
        "summaKeyWords": [
            "hoping",
            "book",
            "reading books",
            "spent hours",
            "library",
            "feel bad",
            "involves going",
            "special",
            "step",
            "process",
            "main thing",
            "requires",
            "software",
            "absolute",
            "pain",
            "husband trying",
            "id"
        ],
        "sentiment": 0.9194
    },
    "73": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "T.C. Doust",
        "reviewText": "In my opinion, the Nook Simple Touch is the best e-reader on the market because... well... it's simple. No distractions of email or social media, it lets me immerse myself in a book and I love it!",
        "summary": "Love My Nook",
        "unixReviewTime": 1383177600,
        "vote": null,
        "index": 73,
        "summaKeyWords": [
            "simple",
            "nook",
            "touch",
            "e",
            "best",
            "media"
        ],
        "sentiment": 0.7574
    },
    "74": {
        "overall": 2,
        "asin": "140053271X",
        "reviewerName": "Tasha Cleveland",
        "reviewText": "I guess i got what i paid for, considering i paid less than 30 for it. works sparingly. should have waited and spent my hard earned money else where.",
        "summary": "bought as replacement",
        "unixReviewTime": 1382400000,
        "vote": null,
        "index": 74,
        "summaKeyWords": [
            "sparingly",
            "works",
            "earned money"
        ],
        "sentiment": -0.1027
    },
    "75": {
        "overall": 4,
        "asin": "140053271X",
        "reviewerName": "Mr. Okapi",
        "reviewText": "While it doesn't have a light and its screen has been far surpassed by other readers throughout the years. However since it uses android you can easily root it and install apps that allows you to read Kindle books and pretty much anything else your heart desires. Even can play Angry Birds if you really wanted to.",
        "summary": "Great ebook reader and easily hackable",
        "unixReviewTime": 1381708800,
        "vote": null,
        "index": 75,
        "summaKeyWords": [
            "far surpassed",
            "kindle books",
            "read",
            "easily root",
            "install apps",
            "angry",
            "heart",
            "desires",
            "play",
            "birds"
        ],
        "sentiment": 0.5719
    },
    "76": {
        "overall": 4,
        "asin": "140053271X",
        "reviewerName": "Scott S.",
        "reviewText": "Wish the screen were a bit brighter & that current books were available for less. It works great though and I'm looking forward to leaving heavy hardback books at home.",
        "summary": "Happy but...",
        "unixReviewTime": 1378598400,
        "vote": null,
        "index": 76,
        "summaKeyWords": [
            "bit brighter",
            "works great",
            "looking forward",
            "books",
            "heavy hardback"
        ],
        "sentiment": 0.8456
    },
    "77": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Robert O. shumate",
        "reviewText": "was given as a gift, she loves it and has given her many hours of pleasure, reading lots of books.",
        "summary": "good product",
        "unixReviewTime": 1378252800,
        "vote": null,
        "index": 77,
        "summaKeyWords": [
            "pleasure reading"
        ],
        "sentiment": 0.8834
    },
    "78": {
        "overall": 1,
        "asin": "140053271X",
        "reviewerName": "myjudge2",
        "reviewText": "My screen stopped working a week out of warranty.  Apparently, this is a common issue with the Nook Simple Touch.  Customer service told me that Barnes & Noble is aware of this issue but they do not plan to repair or replace anything.  This is not the way to treat customers.  I am canceling all my pre-orders and I will try a different ereader.",
        "summary": "Has known screen problems",
        "unixReviewTime": 1378166400,
        "vote": null,
        "index": 78,
        "summaKeyWords": [
            "screen stopped working",
            "apparently",
            "warranty",
            "pre",
            "common issue",
            "different",
            "ereader",
            "barnes",
            "noble",
            "customers",
            "customer service told",
            "touch",
            "simple"
        ],
        "sentiment": 0.6249
    },
    "79": {
        "overall": 1,
        "asin": "140053271X",
        "reviewerName": "Citris1",
        "reviewText": "Unboxed the Nook. Charged it up. Won't connect to my Wifi network when three laptops in my house will. And it won't work at all until you register it. Posts on the Internet say its a complex technical issue. I'm calling the B&N tech people. If they can't fix it fast then this thing is going back. I didn't sign up for hours of struggling with Nook's technical problems. I have better things to do.\n\nUpdate: Customer service didn't help. Took it to Barnes & Nooble Store but the battery had drained in less then a week so they couldn't look at it. I figured if the battery can't hold a charge for that long than I didn't want the device. The seller agreed to take it back for a restocking fee and I had to pay for shipping. This thing cost me time and money, a bad experience all  around. I'll never buy a B & N product again, certainly not from a third party seller.  I've ordered a Sony reader directly from Sony. Hopefully I'll have better luck",
        "summary": "Bad experience.",
        "unixReviewTime": 1376784000,
        "vote": 3.0,
        "index": 79,
        "summaKeyWords": [
            "nook",
            "charged",
            "charge",
            "calling",
            "internet say",
            "nooble",
            "better things",
            "thing",
            "customer service",
            "n product",
            "store",
            "barnes",
            "update",
            "took",
            "help",
            "bad experience",
            "b tech",
            "cost",
            "luck",
            "restocking fee",
            "people",
            "wifi network",
            "seller agreed",
            "sony reader directly",
            "party",
            "ordered"
        ],
        "sentiment": 0.3614
    },
    "80": {
        "overall": 4,
        "asin": "140053271X",
        "reviewerName": "Bill S",
        "reviewText": "If you only want to read, this is fine. The newer models access the web, have apps, play games, do email and color. This model is only print and only black and white.",
        "summary": "Excellent for what it is",
        "unixReviewTime": 1376092800,
        "vote": null,
        "index": 80,
        "summaKeyWords": [
            "model",
            "newer models access",
            "apps play"
        ],
        "sentiment": 0.5423
    },
    "81": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Don Sink",
        "reviewText": "Ordered this product for a family memeber . Excellent service from Barnes and Noble on set up and operation. I would highly reocommend this product for anyone who likes to read",
        "summary": "Extremely handy",
        "unixReviewTime": 1375315200,
        "vote": null,
        "index": 81,
        "summaKeyWords": [
            "excellent service",
            "family memeber",
            "reocommend"
        ],
        "sentiment": 0.8591
    },
    "82": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Lori E. Straley",
        "reviewText": "Bought this as a gift for my husband.  He didn't think he would use an e-reader.  The Nook is so easy to set up and use.  I have one too and we both read with them all the time.",
        "summary": "Gift",
        "unixReviewTime": 1372896000,
        "vote": null,
        "index": 82,
        "summaKeyWords": [
            "e"
        ],
        "sentiment": 0.7678
    },
    "83": {
        "overall": 4,
        "asin": "140053271X",
        "reviewerName": "JDM",
        "reviewText": "Wife bought this for her elderly mother - but she couldn't quite get the hang of using it (tech challenged)... My wife has been using it instead and seems to like it pretty well... All is good :)",
        "summary": "Does the job and good for the money spent...",
        "unixReviewTime": 1372291200,
        "vote": null,
        "index": 83,
        "summaKeyWords": [
            "wife bought",
            "challenged",
            "tech",
            "mother"
        ],
        "sentiment": 0.9468
    },
    "84": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Frederic",
        "reviewText": "Satisfied with this purchase. The Nook was brand new in an open box. Works like a gem. Very happy customer!",
        "summary": "Exactly as described. Very happy!",
        "unixReviewTime": 1370649600,
        "vote": null,
        "index": 84,
        "summaKeyWords": [
            "brand new",
            "box",
            "works",
            "happy",
            "customer",
            "open"
        ],
        "sentiment": 0.862
    },
    "85": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "carlos cedeno",
        "reviewText": "the reason ill take a eInk reader over a kindle eInk reader,  is because the nook has expandable memory (up to 32GB). when you get to the fire and nook color\/tab its a different story. the simple touch is light weight and the battery life is amazing. if you just need an eReader with out browsing the web this is perfect. feels great in the hand, the screen size is just right and loading books are very easy. although if you can afford a simple touch with glow i would say get that one for the light.\n\nthe only thing you have to get use to is the screen being a little jumpy when you switch from one thing to another. i believe its because of the eInk style.",
        "summary": "Great eReader",
        "unixReviewTime": 1369958400,
        "vote": null,
        "index": 85,
        "summaKeyWords": [
            "reason ill",
            "eink reader",
            "kindle",
            "style",
            "screen size",
            "loading books",
            "color",
            "different",
            "story",
            "little jumpy",
            "perfect feels great",
            "nook",
            "light weight",
            "simple touch",
            "battery"
        ],
        "sentiment": 0.9199
    },
    "86": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Kindle Customer",
        "reviewText": "This is my 1st reader so I can't compare.  I like the sharpness of the letters.  It makes for easy reading.  In conjunction with calibre this is really easy to use.",
        "summary": "1st reader",
        "unixReviewTime": 1368835200,
        "vote": null,
        "index": 86,
        "summaKeyWords": [
            "st reader",
            "reading"
        ],
        "sentiment": 0.5309
    },
    "87": {
        "overall": 2,
        "asin": "140053271X",
        "reviewerName": "Impossible Girl",
        "reviewText": "I bought this to replace a Sony PRS-300 that I thought was too heavy and too slow in the page turning.  Yes, the nook is quicker on the page turning and lighter but I am having too much trouble to appreciate faster and lighter.  I am having an infinite amount of trouble getting library books onto the nook - I've yet to succeed and the problems lie with adobe digital editions.  Why aren't nooks plug and play?  That's my first big problem.  I have no problem with my Sony and the library book I wanted is now on my Sony.  The second is that I like to read while I'm eating my lunch - ereader in left hand and fork in right.  It is not easy to change the page on the nook while eating - the bottom right corner is too far from my thumb and the bottom buttons are too high up the side.  The Sony has a set of buttons right in the bottom center, which is perfect placement.  I read the great reviews on the nook and for the price, I thought it was worth a try.  I'm also disappointed with the wifi registration requirement and wifi in general.  I don't need wifi on my ereader but it looks like they're all offering it now.  I also don't appreciate my registration info being used by B&N as permission to start emailing me crap - I am already unsubscribed from that 'service'.  I'm definitely not happy with the nook and I'm going to save up my money to buy another Sony.\n**UPDATE 5\/25\/13**  I finally was able to download library books onto my nook but it was frustrating and time consuming; I finally found help online.  I have yet to discover a way to comfortably hold this book in my left hand and turn the page.  This was a very bad buy for me.  I bought a book-style cover for it and that was a waste of money as well as I find the cover just gets in the way.  I did not know how good I had it with the Sony PRS-300 and will continue to use my Sony instead of the nook.  I don't recommend the nook at all.",
        "summary": "disappointed",
        "unixReviewTime": 1368748800,
        "vote": null,
        "index": 87,
        "summaKeyWords": [
            "sony",
            "instead",
            "update",
            "prs",
            "turning",
            "turn",
            "wifi registration requirement",
            "problem",
            "page",
            "yes",
            "time",
            "consuming",
            "looks",
            "like",
            "problems lie",
            "adobe digital",
            "info",
            "need",
            "appreciate faster",
            "eating",
            "definitely",
            "going",
            "right",
            "big",
            "ereader",
            "lunch",
            "help",
            "online",
            "left hand",
            "getting library books",
            "great reviews",
            "book",
            "gets",
            "editions",
            "placement",
            "perfect",
            "corner",
            "buttons",
            "buy",
            "bad",
            "b",
            "start emailing",
            "cover"
        ],
        "sentiment": 0.8601
    },
    "88": {
        "overall": 1,
        "asin": "140053271X",
        "reviewerName": "Nicusor Chirca",
        "reviewText": "The unit that was sent to me does not power on. I searched on the Internet and a lot of other people have the same issue. It seems there is a problem with the batteries on these units.... They are supposed to last for a long time, but mine did not even power on once. It would be nice for the end user to be able to take the battery out and replace it; I am going to have to send mine back, even though I had to wait a while to get this one and was looking forward to use it, play with it, test it. Ok, so I sent this one back and got the money back, but not the cost to send it back to seller. I bought a second one from another seller. This one powered on, but had other serious issue with it. I tried to insert a micro SD card, but the casing for the card reader was misaligned and my card fell in the device itself. As this could have been labeled as my fault, that I did not pay enough attention to the casing, I did not try to send it back. Plus, I had to take my card out from inside the device somehow. I decided to open the device and forget about warranty to be able to get the card out. I tried to align the casing of the card reader, but instead I managed to break it entirely. The small metal plates broke in one spot and I decided to peel it off completely. I was able to finally put the cover back on the whole device, but without damaging some places of the plastic cover. I figured that 2GB of internal memory would be enough and I would be loading books on it through the USB connector, by connecting to a computer. But it turns out it does not have 2GB available internally to put books on. It only has 250 MB, like other reviewers have mentioned. I do not know if I can root the device without a card reader to put a card in. Have not tried to root it yet, but I read on the internet that it is possible. That would be the obvious solution to many of its software limitations. I went ahead and bought a third device because I really want a book reader with an E-Ink screen that has a card reader and that one seems fine, but I did not played with it much.",
        "summary": "Defective units.",
        "unixReviewTime": 1368489600,
        "vote": null,
        "index": 88,
        "summaKeyWords": [
            "long",
            "time",
            "card",
            "cover",
            "plastic",
            "available internally",
            "e screen",
            "connector",
            "usb",
            "sd",
            "reader",
            "book",
            "internal memory",
            "end user",
            "loading books",
            "gb",
            "went ahead",
            "micro",
            "fell",
            "limitations",
            "software",
            "small metal plates broke",
            "mb like"
        ],
        "sentiment": 0.8567
    },
    "89": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "raymar",
        "reviewText": "Ordered for a freind. As far as I know, his daughter is happy with it. I guess you could call him.",
        "summary": "Good Price",
        "unixReviewTime": 1367539200,
        "vote": null,
        "index": 89,
        "summaKeyWords": [],
        "sentiment": 0.5719
    },
    "90": {
        "overall": 3,
        "asin": "140053271X",
        "reviewerName": "mj",
        "reviewText": "It seems to be a limited device, but it has potential  I think a good price it new should be about $55.00. I have one as a backup to my kindle P.W there are two pros ,the SD card slot and it can be rooted, but rooting affects battery life and its not stable when rooted. Very very limited web browser no Facebook or anything useful, the browser on the the paperwhite is much better. It is a pretty well made device.\nIt is a ok back up to my kindle paperwhite.",
        "summary": "I have come to like it a little better.",
        "unixReviewTime": 1366761600,
        "vote": null,
        "index": 90,
        "summaKeyWords": [
            "limited",
            "web browser",
            "device",
            "sd card slot",
            "kindle",
            "p",
            "rooting affects battery life",
            "paperwhite",
            "rooted"
        ],
        "sentiment": 0.9368
    },
    "91": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "That Guy",
        "reviewText": "Product shipped quickly, and arrived slightly ahead of schedule, even from the other side of out country.\nThe stated storage capacity is rather misleading. It says 2gb, but half of that seems reserved for the system, and most of what's left is reserved for B&N's ebooks. That leaves about 250mb for the rest of your library.\nFortunately, a 4gb microSD card cost me a measly $5. Even better, memory card integration is seamless.\nAmazon's got a great price, too. $10 cheaper than anyone else. Ironic, considering the Nook is their direct competitor.\nOne thing to take into consideration is that the page numbers are synced with the actual pages of the ebook, regardless of font size or line spacing, so you can turn through page 85 two or three times before getting to page 86. It's a little weird, but not a major issue.\nI got my paws on one of these things in the store, and I'm still surprised at how light and small it is.\nThe last consideration (not really an issue, but an odd choice on their part) is the lack of a file manager on the device. You have to plug the Nook into a computer to delete files. However, it's irrelevant, since all of my ebooks are on the memory card, and I bought a USB adapter for that very reason.\nAll in all, this is a fantastic product, and I am very pleased with it.",
        "summary": "Reach out and Touch someone",
        "unixReviewTime": 1366070400,
        "vote": null,
        "index": 91,
        "summaKeyWords": [
            "quickly",
            "product shipped",
            "fantastic",
            "gb",
            "card cost",
            "says",
            "arrived slightly ahead",
            "integration",
            "better memory",
            "files",
            "stated storage capacity",
            "file manager",
            "page numbers",
            "actual pages",
            "delete",
            "ironic considering",
            "little",
            "ebooks",
            "ebook",
            "b",
            "price",
            "library",
            "issue",
            "font size",
            "seamless",
            "odd choice",
            "line",
            "spacing",
            "adapter",
            "direct",
            "major",
            "competitor",
            "fortunately",
            "weird"
        ],
        "sentiment": 0.8892
    },
    "92": {
        "overall": 4,
        "asin": "140053271X",
        "reviewerName": "cbmb",
        "reviewText": "I bought it for my grandson and he loves it! I little scarry putting my credit card in it to purchase, but the item itself is great",
        "summary": "nook",
        "unixReviewTime": 1365379200,
        "vote": null,
        "index": 92,
        "summaKeyWords": [
            "little scarry putting",
            "credit"
        ],
        "sentiment": 0.8777
    },
    "93": {
        "overall": 4,
        "asin": "140053271X",
        "reviewerName": "Joshua Flavin",
        "reviewText": "The advantage of the nook over a kindle is simplicity when you aren't buying a book (ie, when you're obtaining a digital backup of a physical book you own, library digital checkouts, or you're pirating one.)  All the books I buy are from Amazon, and so with the nook it won't sync those which is unfortunate.  But where it shines is when I refuse to buy a book because the publishers are being greedy (eg, Dance with Dragons by George RR Martin, game of thrones series...  The ebook costs more than a physical copy.  It even costs more than a physical copy translated into another language!  Give me a break!)  So anyway, when it comes down to piracy to keep the publishers in check - the nook is great.  You plug it into USB, it shows up as a drive on the computer.  You type in the name of a book into google and add \"epub download\" to the end, and somewhere on the first page of results is a working download (at least with every book I've had to try so far.)  Download that straight to the nook's drive letter and you're done.\n\nThe main reason I wanted it originally, before I found out how incredibly easy the above was, was because of the shape and feel.  I love the shape and feel over the kindle.  But other than that and the simplicity I'd probably go with a kindle for legit purchases (also I'm pretty sure the nook has been officially abandoned by B&N, which will of course make any syncing that may have existed even more problematic in the future.)",
        "summary": "Great size and feel, great for non-purchased books",
        "unixReviewTime": 1363996800,
        "vote": null,
        "index": 93,
        "summaKeyWords": [
            "digital backup",
            "library",
            "checkouts",
            "copy",
            "physical",
            "translated",
            "book",
            "books",
            "probably",
            "rr",
            "martin game",
            "course make",
            "series",
            "thrones",
            "george",
            "letter",
            "drive",
            "download",
            "main reason",
            "pretty sure",
            "b",
            "epub",
            "incredibly easy",
            "legit purchases",
            "add",
            "far",
            "working"
        ],
        "sentiment": 0.9292
    },
    "94": {
        "overall": 4,
        "asin": "140053271X",
        "reviewerName": "Yaz",
        "reviewText": "I love reading, and in a lot of cases I found myself leaving a book at home because I didn't want to carry any heavy things. This is great! I put in a small 512MB card and now it holds ~50 books! I gave it 4 stars only because the dictionary function isn't very good. I think it has a literal copy of a dictionary, which means it doesn't explain the word fully but still doesn't allow you to search for the meaning of a work in the translation window...",
        "summary": "Greatest purchase for an avid reader",
        "unixReviewTime": 1363824000,
        "vote": null,
        "index": 94,
        "summaKeyWords": [
            "reading",
            "love",
            "dictionary function",
            "mb card",
            "isn",
            "small",
            "holds",
            "book",
            "books",
            "literal copy",
            "heavy",
            "things",
            "word fully"
        ],
        "sentiment": 0.4239
    },
    "95": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Daac",
        "reviewText": "Great e-reader!\nThe user interface is great, atractive, smooth and clean!  There were only 2 minnor issues:\n\n1. The built-in Wi-Fi couldn't connect to my home network, but a simple software update from the B&N support page fixed that.\n\n2. The description says that the device has a 2GB internal memory, the one I got doesn't have that amount of memory.  Probably someone forgot to insert the 2GB SD Card in the device, but that's not a big deal!\n\nOverrall, great device!!!",
        "summary": "Great a-reader",
        "unixReviewTime": 1362614400,
        "vote": null,
        "index": 95,
        "summaKeyWords": [
            "great",
            "device",
            "atractive smooth",
            "overrall",
            "e",
            "big",
            "deal",
            "memory",
            "sd",
            "gb internal",
            "description",
            "b support page fixed",
            "simple software update",
            "issues",
            "user interface",
            "home",
            "network",
            "couldn",
            "probably"
        ],
        "sentiment": 0.954
    },
    "96": {
        "overall": 4,
        "asin": "140053271X",
        "reviewerName": "Momma2*3",
        "reviewText": "We have the old Nook reader, which we love. We purchased this Nook at target for the same price as Barnes and Noble and Amazon.\nThis Nook is smaller, which is nice. It has a built in light, which is really nice. And, it is touch screen, which is awesome!\nThe only flaw I see thus far is that you can't resize the letters. Apparently the letters are a standard size, I assume because of the size of the screen? Anyway, I would like to make them smaller so that I can read more before turning the page. However, that is a minor issue and does not deter me from enjoying the new Nook tremendously.",
        "summary": "Simple, great back light, comfortable size",
        "unixReviewTime": 1361836800,
        "vote": null,
        "index": 96,
        "summaKeyWords": [
            "nook",
            "old",
            "reader",
            "new",
            "tremendously",
            "standard",
            "size",
            "apparently",
            "letters",
            "minor issue"
        ],
        "sentiment": 0.9744
    },
    "97": {
        "overall": 2,
        "asin": "140053271X",
        "reviewerName": "catlady",
        "reviewText": "This is an update from my initial review.\n\nThis Barnes & Noble Nook Simple Touch was advertised by BlueProton at Amazon as having been marked down from $249.99 to $68.99, so it certainly seemed like a great deal. It now seems like fraudulent advertising because I've since read that the MSRP is $79.99\n\nInitially I had serious problems with the Nook, and requested a refund. The seller, BlueProton, refused to take returns or give a refund for it, and directed me to Barnes & Noble who referred me back to the seller, stating  that the seller should refund it within 14 days; at that time  I'd only had it a few days. My Amazon A to Z claim ended with Amazon siding with the seller, BlueProton because their policy stated that they would not accept returns on Nooks - something I did not see when I initially read their policy!\n\nBecause neither BlueProton nor Barnes & Noble would take responsibility for the defective product, and their attitude was \"Take the money and run!\", I'm giving the Nook a low review although later I found an update for the Nook which resolved the problems - with no help or information from either seller or Barnes & Noble!\n\nI now enjoy using the Nook which is so much easier and more comfortable to hold than regular books while reading,  and to carry back & forth to work each day or to travel with. I don't like the gray screen which requires you to face the Nook towards the light; and I don't like the glare on the screen from the sun or lights. I have to sit \"just so\" to read it - which somewhat defeats the idea of portability. Overall I do like it, but it needs improvement.\n\nMy favorite use of the Nook is to borrow my local library's digital books using the free Overdrive Media Console software which allows you to select & save your library (ies) and to directly access the digital library from it on your PC, and then sideload (drag & drop)the borrowed books to your Nook; no more time wasted or trips through rush hour traffic to browse, borrow or return books downtown, and no more parking hassles! Most of my library's digital books are in ePub format which is the native format of the Nook. However, as other reviewers have stated, you can still borrow or buy Kindle or other formats of digital books and convert them to ePub via the free Calibre software. Borrowed library books can be returned automatically when the loan periods expire, or can be returned manually earlier if you decide not to finish the book during the loan period.\n\nOrdinarily I don't buy many fiction books because I rarely read any of them more than once. Additionally, due to the poor customer service from both Amazon (who owns Kindle) and Barnes & Noble (who owns Nook) I am determined to rarely buy any books from either of these companies, and will primarily download either their free books or the library's loan books. The companies want us to buy their ebooks, but won't take responsibility for their e-readers, so that infuriates me and alienates me for life.\n\nThe pros: the low price; comfort; convenience; savings from being able to borrow library books instead of buying something you'll only read once; no clutter of physical books; easy loaning to friends with a guarantee that they will be returned in 14 days (automatic returns); ability to read multiple formats via conversion in free Calibre software. The Nook can also read your PDF files\/documents from your PC or elsewhere, plus it can use your JPEG files of photos to use as your custom screensavers; the Nook will convert them to B&W.\n\nThe cons: PlueProton's and Barnes & Nobles's total lack of responsibility for their defective Nooks - why I gave the Nook such a low rating; Amazon's siding with Blue Proton's irresponsible returns policy; dreary gray screen which makes it difficult to read except in bright lighting; touch screen not as sensitive and responsive as it should be - often have to touch the screen a few times before getting a response.\n\nOver all I'm pleased with my Nook Simple Touch now that I managed to FIX IT BY MYSELF, but the companies' irresponsible policies have soured me towards them for life.",
        "summary": "no responsibility from sellers for initially defective  new product",
        "unixReviewTime": 1361836800,
        "vote": 5.0,
        "index": 97,
        "summaKeyWords": [
            "books",
            "book",
            "returns",
            "return",
            "files",
            "custom",
            "returned automatically",
            "nook",
            "nooks",
            "policies",
            "formats",
            "borrow",
            "drag",
            "period",
            "low",
            "touch",
            "library digital",
            "read",
            "reading",
            "loan periods",
            "policy stated",
            "free",
            "drop borrowed",
            "save",
            "proton irresponsible",
            "fraudulent advertising",
            "amazon",
            "convenience savings",
            "blueproton",
            "poor customer service",
            "epub format",
            "light",
            "lights",
            "lighting",
            "defective",
            "noble",
            "console software",
            "easy loaning",
            "comfortable",
            "comfort",
            "rating",
            "seller",
            "nobles total lack",
            "wasted",
            "time",
            "times",
            "parking",
            "needs",
            "hassles",
            "z claim ended",
            "improvement",
            "favorite use",
            "e",
            "primarily download",
            "b",
            "plueproton",
            "cons",
            "portability",
            "somewhat defeats",
            "directly access",
            "great",
            "deal",
            "directed",
            "overall",
            "blue",
            "rush hour traffic",
            "companies",
            "multiple",
            "price",
            "automatic",
            "manually",
            "kindle",
            "buy",
            "buying",
            "owns",
            "review",
            "reviewers",
            "rarely",
            "initial",
            "initially",
            "simple",
            "gray screen",
            "stating",
            "dreary",
            "media",
            "overdrive",
            "calibre",
            "giving",
            "pleased",
            "like",
            "advertised",
            "sideload",
            "pdf",
            "jpeg",
            "screensavers",
            "select",
            "siding",
            "refused",
            "native",
            "bright",
            "product",
            "barnes",
            "want",
            "days",
            "day"
        ],
        "sentiment": 0.9887
    },
    "98": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "leslie eckhardt",
        "reviewText": "Smart, sleek and easy-to-read, this Nook is my first E-reader and I am very happy with it. Easy to use all the controls on it and it features an easy to understand manual so you can access all of the reader's many features. Good price, too.",
        "summary": "E-readers are a great way to build your library",
        "unixReviewTime": 1361750400,
        "vote": null,
        "index": 98,
        "summaKeyWords": [
            "smart sleek",
            "e",
            "reader",
            "good",
            "features",
            "price",
            "understand"
        ],
        "sentiment": 0.9371
    },
    "99": {
        "overall": 1,
        "asin": "140053271X",
        "reviewerName": "KtnWin",
        "reviewText": "I have gone thru a lot of reviews of this eBook before ordering it, mainly due to its long battery life.\nWithin a week, it got shipped home (excellent seller).\nHowever, the product itself is far from being a good eBook Reader.\nI have had two: one Kindle eBook reader (with keyboard) and one 10.2\" Android tablet that I used as a reader mainly.\nThe Nook is cumbersome:\n\nTHE BADS:\n1) the first thing it ask for is to read some kind of agreement, then click ACCEPT !!! (like I am installing a new software !!!)\n2) the second thing is to setup for a WIFI access, I have troubled to enter the password for my home wireless so it sits there for one day. Can't do anything until WIFI access is established.\n\nTHE GOODS\n3) I went to a local B&N store to get instant WIFI access which I did,\n\nTHE BAD\n4) then create an account, enter my credit card number (why do I need to do this at this time). Should only ask when I first order something from B&N.\n\nTHE GOOD:\n5) now I can copy my eBook in PDF formats to it, this part is straightforward.\n\nTHE BAD:\n6) I opened one of my PDF doc and it came up with a huge font size\n7) try to touch the screen to get to a menu allowing me to change font size, the menu appears, then quickly disappears. I was very frustated trying to get the menu display to stay there\n8) it took me a few mins before I can get the menu to be stable, then change to a smaller size. The text now reads fine. But the \"next page\" , \"previous page\" buttons are too hard to push, it takes a hard push to get it to work.\n\n9) I close the document and try to open another one, it won't open\n10) try to re-open the first one, not open either\nFrom this point on, it simply refused to open any document I have on it.\n\n11) I even convert one PDF to epub format (specifically target the Nook)  and load on it, does not open either. And the epub size is much larger than PDF size (i.e. I will have a lot less books on it).\n\nTo me, this eBook is useless, so I am going to return it back today.\nAnd this is not due to (or lack of) my high tech proficiency (I develop firmware for \"firwmare operated\" gadgets by trade , really know how to use these \"Software\/firmware\" operated gadgets quite well, have at least 5 GADGETS with very complicated functionalities at home, all of them require patient readings thru their thick manuals to operate \/ setup to my liking, no problem at all).\n\nI have written quite a lot of product reviews on Amazon, most of the gave good rating because these products are good.\nI feel really frustrated with this one, the first bad review I wrote.\n\nMy older two eBook readers work right of the box. Just copy the documents to it and open to read them.\nI will NEVER buy these kinds of eBook readers anymore, not even the new Kindle as I heard they will show ads on the screen and the Kindle Fire will just immediately buy stuff from Amazon if I accidently click on some place, IT DOES NOT even show a confirmation screen (too greedy to make money) !!! I don't buy something to read these ads. Amazon and B & N are too greedy trying to push stuff on the users as they feel like, at the users expense.\n\nI will try to get a new Android tablet instead (for reading, and Internet browsing). Rather spend a few hundreds bugs to get a good product than a cheap one that does not work.\nMany users were lucky to get the ones that work (touch scree sensitivity seems to be the key here), I was not and don't want to try my luck with it again.",
        "summary": "very clumsy not functional",
        "unixReviewTime": 1359936000,
        "vote": 2.0,
        "index": 99,
        "summaKeyWords": [
            "operate",
            "try",
            "trying",
            "good",
            "goods",
            "reader",
            "readers",
            "firmware",
            "work",
            "page",
            "wifi",
            "huge font size",
            "pdf formats",
            "ebook",
            "operated gadgets",
            "menu allowing",
            "read",
            "reads",
            "reading",
            "n",
            "like",
            "liking",
            "click",
            "push",
            "buy",
            "accept",
            "stuff",
            "excellent",
            "got shipped home",
            "new software",
            "epub format",
            "reviews",
            "review",
            "long battery",
            "require patient readings",
            "android tablet",
            "touch",
            "product",
            "products",
            "thing",
            "second",
            "hundreds bugs",
            "complicated functionalities",
            "credit card number",
            "amazon",
            "browsing",
            "screen",
            "quickly",
            "ads",
            "confirmation",
            "high tech proficiency",
            "money",
            "disappears",
            "internet",
            "make",
            "simply refused",
            "account",
            "enter",
            "b store",
            "expense",
            "users",
            "kindle",
            "scree sensitivity",
            "specifically target",
            "instant",
            "previous",
            "buttons",
            "access",
            "life",
            "fine",
            "local",
            "display",
            "appears",
            "feel",
            "accidently",
            "hard",
            "immediately",
            "seller",
            "wireless",
            "bads",
            "bad",
            "instead",
            "setup",
            "firwmare",
            "change"
        ],
        "sentiment": 0.6671
    },
    "100": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "SomaKindaWonderful",
        "reviewText": "This was a Christmas gift for my daughter, who is in the Army currently. She loves it to death and then some!",
        "summary": "Great Gift",
        "unixReviewTime": 1359504000,
        "vote": null,
        "index": 100,
        "summaKeyWords": [
            "christmas gift",
            "currently"
        ],
        "sentiment": 0.4574
    },
    "101": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "sgun73",
        "reviewText": "I've used the Nook Touch and the Kindle Touch\/Kindle Paperwhite extensively and the Nook is the best. Why? I'm convinced that if anyone prefers the Kindle its because they've never tried the Nook. Or they have friends that used Kindle and don't want to venture out on their own.\n\nFirst the Nook feels better. It has a soft plastic outside with a curved back that makes holding the device quite pleasant. It has just enough area around the screen that you can hold easily without mistakenly turning pages. And the side page turn buttons are deep enough you won't turn pages by accident. Some might not like it because you have to push pretty hard, but that's by design.\n\nSecond the platform is user friendly and great to navigate.\n\nThird the font choices are better and you get several more to choose from. Plus the size options all make sense. For instance on the Kindle the couple smallest font sizes are so small I can't see why anyone would use them and to me it's a waste.\n\nFourth the buttons are all well placed.\n\nFifth there are no ads and you can even upload your own pictures.\n\nGo try one today. I'm fairly confident you'll love it.....unless you don't.",
        "summary": "Best ebook reader above all others by far!",
        "unixReviewTime": 1358985600,
        "vote": null,
        "index": 101,
        "summaKeyWords": [
            "feels",
            "paperwhite extensively",
            "better",
            "nook",
            "kindle",
            "fairly confident",
            "touch",
            "convinced",
            "sizes",
            "size options",
            "fifth",
            "push pretty",
            "font choices",
            "placed",
            "design",
            "couple smallest",
            "hard",
            "second",
            "soft plastic",
            "sense",
            "user friendly",
            "friends",
            "hold easily",
            "waste",
            "holding",
            "turn buttons",
            "mistakenly turning"
        ],
        "sentiment": 0.985
    },
    "102": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Amazon Customer",
        "reviewText": "At first I was torn between the Nook Simple Touch and the Kindle Paperwhite. I chose the Nook because of price and the absence of ads while reading a book. I had though that the Nook did not have a good dictionary function, but learned otherwise after it's purchase. All one needs to define a word from the dictionary is to place their finger on the word for two seconds and then chose the Look Up option on the bottom menu displayed on the left.\n\nSharp resolution, useful utilities, convenient scrolling functions both off on the side of and on the screen. Lightweight, durable and well designed. Essay to download free books (I suggest Project Gutenberg). For downloading free books from on line sites or from the library, you will need to download Adobe Digital Edition 2 software which is free.\n\nI suggest that you purchase additional memory. Barnes and Noble only allocates 1\/4 of a GIG out of 2GIG for your personal library from non Barnes and Noble books. One gig for software to run the Nook and 3\/4 for books purchased from Barnes. The best buy for external memory is 8 GIG. I also suggest that your purchase one CaseCrown leather Regal flip case sold through Amazon; they are high quality for a reasonable price.",
        "summary": "Recommended e-reader",
        "unixReviewTime": 1358208000,
        "vote": null,
        "index": 102,
        "summaKeyWords": [
            "simple",
            "nook",
            "touch",
            "lightweight durable",
            "high quality",
            "screen",
            "essay",
            "designed",
            "reasonable",
            "price",
            "paperwhite",
            "kindle",
            "memory",
            "book",
            "download free books",
            "barnes",
            "additional",
            "purchase",
            "purchased",
            "downloading",
            "digital",
            "adobe",
            "edition",
            "menu displayed",
            "line sites",
            "regal flip case sold",
            "project",
            "casecrown leather",
            "sharp",
            "resolution useful",
            "dictionary",
            "utilities convenient scrolling functions",
            "function",
            "personal",
            "library",
            "external",
            "non",
            "noble",
            "software"
        ],
        "sentiment": 0.9887
    },
    "103": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "C. Sousa",
        "reviewText": "I would highly recommend this item to anyone just wanting an e-reader it's great!!  It arrived very quickly and in great shape.",
        "summary": "Nook",
        "unixReviewTime": 1356566400,
        "vote": null,
        "index": 103,
        "summaKeyWords": [
            "highly recommend",
            "shape",
            "great"
        ],
        "sentiment": 0.9114
    },
    "104": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Amazon Customer",
        "reviewText": "Haven't had it but a few weeks, but I am learning how to download from the library, etc.  love how light it is and that it will tuck away in a purse for easy reading anywhere.  No operating problems so far.  Would recommend it for home or away\"",
        "summary": "So far, so good.",
        "unixReviewTime": 1356048000,
        "vote": 2.0,
        "index": 104,
        "summaKeyWords": [
            "tuck away",
            "operating problems",
            "reading"
        ],
        "sentiment": 0.8379
    },
    "105": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Chachi",
        "reviewText": "I have had this a few days and I love it! It arrived earlier than expected which is a plus! I have never had a nook before so I'm unsure whether my problem is an issue with my nook or all nooks but the power\/sleep button on the back is loose feeling and is hard to press. Other than that, I have barely put this thing down since it arrived (: good thing I'm on winter break from school!",
        "summary": "Great purchase",
        "unixReviewTime": 1355788800,
        "vote": null,
        "index": 105,
        "summaKeyWords": [
            "good",
            "arrived earlier",
            "thing",
            "unsure",
            "loose feeling",
            "power button"
        ],
        "sentiment": 0.8093
    },
    "106": {
        "overall": 4,
        "asin": "140053271X",
        "reviewerName": "bad girl",
        "reviewText": "I liked the Nook Simple Touch that I purchased and the price was right, but I purchased this model by mistake. I thought it had the glow light and it didn't (my bad!). The company took it back without a problem and charged me a minimal restocking fee. Thanks for understanding!",
        "summary": "Liked but actually returned",
        "unixReviewTime": 1355270400,
        "vote": null,
        "index": 106,
        "summaKeyWords": [
            "simple",
            "touch",
            "nook",
            "fee",
            "minimal restocking",
            "thanks",
            "glow light"
        ],
        "sentiment": 0.7911
    },
    "107": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "DRod",
        "reviewText": "I just received this reader after returning a gifted Kindle.  Nice screen and seems much more white than the Kindle Touch I returned.  I did root it to run Android, so it tends to lag in apps that it was never meant to run, but in reader apps, it's great.  It also has a micro SD slot (32GB works fine) which is the main reason I chose it.  That and the fact that it is so easily rooted, with a large support community.  I liked the Kindle's sleek looks more than the Nook, but the screen on this is definitely better for reading (can't speak for the new Kindle Paper White).  I haven't read outdoors with it yet, so no info there.  Now I have a ton of ebooks and, more importantly, all my college text books in PDF format.  In fact now that it's rooted, I can read any format file by getting an app (including the Kindle app!).  Web browsing is okay with Opera mobile.  Email is great.  Video is not possible, but eink offer a couple of months of battery life (even a few weeks would be great) which makes up for any shortfalls.  I leave my laptop home most days now.  Bottom line: It's the perfect addition to the modern student's toolkit (If you've got a little technical know-how).",
        "summary": "Nice - Especially when rooted with Touch Nooter",
        "unixReviewTime": 1354752000,
        "vote": null,
        "index": 107,
        "summaKeyWords": [
            "kindle",
            "apps",
            "app",
            "mobile",
            "format",
            "sd slot",
            "gb works",
            "large support",
            "little technical",
            "paper",
            "root",
            "rooted",
            "easily",
            "android",
            "run",
            "great",
            "sleek looks",
            "video",
            "modern",
            "college text books",
            "eink offer",
            "perfect addition",
            "definitely better",
            "battery life",
            "laptop home",
            "student",
            "got",
            "read outdoors",
            "reading",
            "main reason",
            "web browsing",
            "nice screen",
            "community",
            "know",
            "opera",
            "email",
            "file",
            "pdf",
            "fine",
            "micro"
        ],
        "sentiment": 0.9908
    },
    "108": {
        "overall": 3,
        "asin": "140053271X",
        "reviewerName": "Cheezhedgirl",
        "reviewText": "The reader is great except you cant use it until you register it. Went to the library and couldn't get on their wifi to do it. Nor could I use macdonalds where they have the at&t hotspot they promised would work. The nook wouldnt let me do it anywhere but a Barnes and Nobles store so I didn't get to use it for almost 2 weeks. Then I made my first purchase of an ebook...1 book...and they double charged me. once through barnesandnoble.com and again through barnesandnoble\/marketplace. They appoligized but wouldnt be putting the money back for 5 days. Since this was cash money they took off my debit card I was just out for days...wonder what would have happened if Id bought 10 books? The nook seems to work great now that I can use it, but using barnes and noble for you ebooks might not be the best idea. They admitted they were having a problem with the double dipping and were trying to fix it. I had it happen 2 years ago when I ordered on line to have paper backs sent to me. So it hasn't been fixed in 2 years:( But I like the nook!",
        "summary": "love the reader \/ hate barnes and noble",
        "unixReviewTime": 1350518400,
        "vote": null,
        "index": 108,
        "summaKeyWords": [
            "work",
            "great",
            "macdonalds",
            "use",
            "barnesandnoble",
            "nook wouldnt let",
            "book",
            "books",
            "best",
            "idea",
            "debit card",
            "paper backs sent",
            "years ago",
            "id bought",
            "happened",
            "happen",
            "ebook",
            "ebooks",
            "cash",
            "money",
            "double",
            "noble",
            "nobles store"
        ],
        "sentiment": 0.8171
    },
    "109": {
        "overall": 3,
        "asin": "140053271X",
        "reviewerName": "JoshM5683",
        "reviewText": "I don't read a ton so I didn't want to pay a huge premium for an e-reader.  I have an iPad but when I do read, sometimes staring at that screen for more than an hour can give me a headache.  It came down to this, the basic Kindle, and the new Kindle Paperwhite.  When I really thought about it, the Paperwhite was more than I really wanted to spend on something I would only use an hour or 2 a week.  I ultimately decided to get this because it could read epub files natively and didn't have to be converted to MOBI files which the Kindle uses.\n\nIt wasn't quite as straight forward as I was expecting.  I initially thought it'd be like the iPad where you just drag the book into the Books section of iTunes and you're ready to go.  I dragged the books onto the Nook when it appeared on my desktop and nothing happened.  I found out you had to download ADE and set it up that way.  From there you have to add the books to ADE then add them to your Nook, not a huge deal, but a few extra steps compared to the iPad.\n\nI also noticed that scrolling between pages had a bit of delay compared to the iPad and that when you were trying to use the scroll bar to advance more than a few pages at a time, it wasn't the most accurate.  It also appears that page sync only works with content you purchase from them and not files you have already on your computer(I think the Kindle is the same way as well though).\n\nThe reading experience is great though.  Its not too bright and easy on the eyes.  The Nook itself is pretty light so its not a hassle to hold it for awhile.  Library is also easy to scroll through once its on your device.\n\nOverall I am happy with it.  I mentioned its shortcomings, but they don't outweigh how easy it is to read and the overall reading experience.  From a reading standpoint I'd give it 5 stars, just some other things that popped up that aren't big deals, but noticable.  I'd recommend this to anyone like myself who doesn't do a ton of reading, but still wants a simple e-reader.  If you are a more serious reader, I'd probably spring for the Paperwhite.",
        "summary": "Not bad, not great, but satisfied",
        "unixReviewTime": 1350345600,
        "vote": null,
        "index": 109,
        "summaKeyWords": [
            "read",
            "overall",
            "epub files natively",
            "reading experience",
            "mobi",
            "device",
            "standpoint",
            "e",
            "big",
            "deal",
            "deals",
            "premium",
            "new",
            "download",
            "use",
            "uses",
            "paperwhite",
            "pretty",
            "delay",
            "extra steps compared",
            "reader",
            "kindle",
            "simple",
            "library",
            "recommend",
            "straight forward",
            "awhile",
            "initially",
            "section",
            "scrolling",
            "scroll",
            "probably spring",
            "page sync",
            "ultimately",
            "pages",
            "ade",
            "thought",
            "basic"
        ],
        "sentiment": 0.9889
    },
    "110": {
        "overall": 2,
        "asin": "140053271X",
        "reviewerName": "Shaun Boyer",
        "reviewText": "this thing was a paperweight from the mint I opened it. and the customer service is just awful. it won't let you go any father unless you register the device and since it would not let me do it I could not use it. went back to the Kindle",
        "summary": "wont let me register the divice right out of the box and won't let me go any farther",
        "unixReviewTime": 1350000000,
        "vote": null,
        "index": 110,
        "summaKeyWords": [
            "customer"
        ],
        "sentiment": -0.4588
    },
    "111": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Adam Flinn",
        "reviewText": "I found tablets and phones lack the battery life and quiet simplicity of this type of specialised product.\n\nForget checking email, listening to audio or constant distractions. This ereader is purely a reading machine. The text is clearer than a laser printed page and the capacity of 32GB micro SD card means accessibility to 10,000's of books.\n\nAs with my Samsung table I found PDF viewings unsatisfactory and even maps in epubs were a disappointment.\n\nAnother issue is that, without a US credit card billing address, B&N will not let you use your account so I have had to store by own epubs in the machine and find them elsewhere.\n\nThe unit is easy to operate and had a claimed battery life of up to two months. It is easily charged from a micro USB connection and files can easily be copied from a PC.\n\nThe crystal clear text and easy touch or button navigation make reading a pleasure. There is only a minuscule delay when turning pages. All in all I am delighted by the unit which is good value for something that holds practically my entire library.",
        "summary": "Been waiting for this for a long time",
        "unixReviewTime": 1345161600,
        "vote": null,
        "index": 111,
        "summaKeyWords": [
            "phones lack",
            "minuscule delay",
            "easy",
            "touch",
            "good value",
            "crystal clear",
            "library",
            "entire",
            "forget checking",
            "product",
            "constant",
            "distractions",
            "sd card means accessibility",
            "text",
            "b",
            "address",
            "billing",
            "gb micro",
            "email listening",
            "easily charged",
            "pages",
            "usb connection",
            "laser printed page",
            "quiet simplicity",
            "specialised",
            "reading",
            "button navigation make",
            "credit",
            "samsung table",
            "turning",
            "battery",
            "viewings",
            "machine"
        ],
        "sentiment": 0.8937
    },
    "112": {
        "overall": 3,
        "asin": "140053271X",
        "reviewerName": "James Hoisington",
        "reviewText": "This a second generation e-reader. By adding a 16 GB micro SD card, it can store more e-books than I'll ever own. Most of my books are in PDF format. It has trouble displaying charts or images and fails totally to display an e-book in PDF form that I bought from Forbes.com. All these books display properly in PDF readers available on personal computers.\n\nIt's other weakness is that it has minimal documentation. The topics are covered but the explanaitons leave the user with a lot of questions.",
        "summary": "Nook Simple Touch e-reader",
        "unixReviewTime": 1343606400,
        "vote": 2.0,
        "index": 112,
        "summaKeyWords": [
            "displaying",
            "display",
            "pdf",
            "readers",
            "e",
            "sd",
            "books",
            "documentation",
            "gb micro",
            "explanaitons leave",
            "minimal",
            "forbes",
            "fails totally",
            "personal",
            "computers",
            "second generation",
            "card",
            "form",
            "format",
            "properly"
        ],
        "sentiment": -0.6059
    },
    "113": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Sven Gold",
        "reviewText": "I know this borderline heresy on Amazon's website, however, I truly prefer the Nook experience over the Kindle!  My main reason is no ads!  Why be tricked into paying $100 for a Kindle that spams you with advertisements when you can cut out the middleman and get an ad-free Nook?\n\nTo be clear, Amazon has 2 identical Kindle Touch versions: with and without advertisements.  You can only get the ad-free version online (for $140) or shell out $40 AFTER you buy the unit.  What?  This is clearly a bait-n-switch because none of this is mentioned if you buy it in a physical store.\n\nThe Nook comes with no advertisements and is a wonderful reading experience!  The touch screen is intuitive and responsive, the ebooks look great, and best of all, no hidden ads!",
        "summary": "Wonderful Reading Experience!",
        "unixReviewTime": 1342396800,
        "vote": null,
        "index": 113,
        "summaKeyWords": [
            "borderline heresy",
            "truly prefer",
            "store",
            "physical",
            "versions",
            "touch",
            "main reason",
            "nook experience",
            "ads",
            "ad",
            "version online",
            "kindle",
            "wonderful reading",
            "clear",
            "clearly",
            "amazon",
            "hidden",
            "comes",
            "screen",
            "identical",
            "look"
        ],
        "sentiment": 0.956
    },
    "114": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Behdad Sassani",
        "reviewText": "The Nook simple touch had made me a fan of reading. I used to be on and off before but never consistent. The fact that it comes with a 2G hard drive and then a micro SD slot makes it easy to start a large library. The weight of it is real light and very easy to use and navigate through. Nothing fancy it just read books and if you got Wifi you can go to the store and look at the endless collection B&N has.",
        "summary": "The best most simple ereader out.",
        "unixReviewTime": 1340496000,
        "vote": null,
        "index": 114,
        "summaKeyWords": [
            "nook simple touch",
            "library",
            "large",
            "g hard drive",
            "real light",
            "sd slot makes",
            "wifi",
            "got",
            "micro",
            "collection",
            "b",
            "reading",
            "read"
        ],
        "sentiment": 0.8294
    },
    "115": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Gor-D",
        "reviewText": "I'm the kind of guy that wants something to function well and that's it.  This thing is brilliant at what it does: displays ebooks.  No frills, no apps, no video, no nonsense.  Because of this it makes it very easy to use.  Download Calibre for free and this baby syncs right up with it.  Battery lasts forever, and it has the same charger as most android smart phones, so In the mornings I take my smartphone off its charger and replace it with my little nook.  I am in the military and as someone else said, this fits perfect in the side cargo pocket of my ABU's.  I had the Kobo, which was a great reader, and my wife had the last nook which I didn't like because it was so damn heavy.  I bought this for me so I could give my Kobo to my little girl.  I was able to snag one used on here from a seller named NikonLover for $47!  This thing is really great.  The only complaint I can make is that the page buttons are a little too recessed, but this is not a huge issue as I turn the pages mostly via touchscreen anyways.  Using this little beauty, and loading all of my own books, and PDF's that I have converted via Calibre, makes me beg the question: Why are people still buying Kindles?  I guess that is the same dilemma I have with Iphones.  Oh well, a fool and his money....  Buy this now!  You will not regret it!",
        "summary": "Best Little Ebook Reader!",
        "unixReviewTime": 1340323200,
        "vote": 3.0,
        "index": 115,
        "summaKeyWords": [
            "displays",
            "ebooks",
            "little",
            "fits perfect",
            "battery lasts",
            "download",
            "calibre",
            "reader",
            "great",
            "forever",
            "pages",
            "page buttons",
            "girl",
            "beauty",
            "nook",
            "use",
            "makes",
            "make",
            "touchscreen",
            "anyways",
            "seller named",
            "buying",
            "buy",
            "cargo pocket",
            "huge issue",
            "nikonlover",
            "kindles",
            "money",
            "baby syncs right",
            "smart",
            "oh"
        ],
        "sentiment": 0.8728
    },
    "116": {
        "overall": 4,
        "asin": "140053271X",
        "reviewerName": "Amazon Customer",
        "reviewText": "The \"newest model\" is the Nook Simple Touch with Glowlight, and not this model.  It may be the newest without a light, but it's not the \"newest\".",
        "summary": "This is NOT the \"latest model\" as stated",
        "unixReviewTime": 1339372800,
        "vote": 3.0,
        "index": 116,
        "summaKeyWords": [
            "model",
            "newest",
            "simple",
            "touch"
        ],
        "sentiment": 0.0
    },
    "117": {
        "overall": 4,
        "asin": "140053271X",
        "reviewerName": "diatonic",
        "reviewText": "I purchased 2 of these in November of 2011. We had a baby on the way and I anticipated lots of reading time. They were so inexpensive I got one for me & one for my wife.\n\nI find the reading experience with the Simple Touch great. The pearl e-ink display has great contrast, and pages turn pretty quickly. I keep the wifi off and battery life is really good. I don't think it's quite as good as BN claims (2 months reading time?) but I can go weeks without charging. I've only purchased a few books though the BN store, I mostly side-load them using Calibre, which works great.\n\nMy wife doesn't read hers as much as I read mine, and the touchscreen on hers will go unresponsive. Holding down the \"n\" button on bottom-front while holding down the top back button forces it to rebook and come back to life. It hasn't been a major issue though.\n\nI purchased a&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"\/Verso-Arc-Light-for-Kindle-Nook-Other-eReaders-Black\/dp\/B004UKNY36\/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">Verso Arc Light for Kindle, Nook, & Other eReaders - Black<\/a>&nbsp;and it works well for reading in low-light situations. The Simple Touch with GlowLight wasn't an option when I bought mine.\n\nOverall it's a great, versatile, light small e-reader.",
        "summary": "Love my Nook Simple Touch",
        "unixReviewTime": 1337212800,
        "vote": null,
        "index": 117,
        "summaKeyWords": [
            "light",
            "great",
            "reading",
            "read",
            "e display",
            "black",
            "bn claims",
            "n button",
            "months",
            "touch",
            "pages turn pretty",
            "holding",
            "unresponsive",
            "anticipated lots",
            "major issue",
            "battery life",
            "wasn",
            "kindle",
            "glowlight",
            "nook",
            "small",
            "versatile",
            "arc",
            "href",
            "forces",
            "quickly",
            "store",
            "ereaders",
            "time",
            "experience",
            "simple",
            "pearl",
            "works"
        ],
        "sentiment": 0.9796
    },
    "118": {
        "overall": 4,
        "asin": "140053271X",
        "reviewerName": "saelba",
        "reviewText": "I've had my NST since last July, and I've been very happy with it.\n\nPros:\n\n- Battery life when wifi is off is as good as advertised.\n\n- The page turn rate was already fast, but the update last November made it super speedy.  Seriously, I've played with the current e-ink Kindles, and the difference in refresh rate might SEEM small on paper, but in practice it's a very noticeable difference.\n\n- I never had the wifi problems others did after the November firmware update, but I understand that the latest firmware update should solve it.\n\n- The NST feels really nice when you're holding it, and I really like that there are physical page turn buttons in addition to the onscreen touch turning - I use both, depending on whether I'm sitting up or lying down when I read, etc.\n\n- Navigation is very intuitive.\n\n- I bought a $5 4gb micro SD card and have had no problems using it with the NST.\n\n- Sideloading non-DRMed, non-B&N content downloaded from places like Project Gutenburg is very easy, and it all goes into the same library as your B&N downloaded content.\n\nCons:\n\n- The user interface is easy to use, but it's also VERY basic, and there are very few features.  You can organize your books into \"shelves,\" but only on the device itself, and it's a cumbersome process.  You can sort books by title, author, and date added, and... that's pretty much it.  The NST isn't a tablet and I don't want it to be, but there are still some pretty simple features that don't seem like it would have been that hard to add, and more flexible organization is one of them.\n\n- Once a book's in the library, you can't really see anything about it besides the title and author. Metadata from sideloaded content doesn't show up, and even purchased content requires you to be on wifi to see more information.\n\nThat's about it. My cons list is really more of a wishlist, and I wouldn't hesitate to recommend the NST to anyone, especially at the lowered $99 price.  I imagine a new touch reader will probably be released within the next few months, but unless the user interface is majorly updated, it's hard to imagine I'd feel the need to upgrade, since the current version meets almost all of my needs perfectly well.",
        "summary": "Best of the e-ink devices currently available",
        "unixReviewTime": 1333497600,
        "vote": null,
        "index": 118,
        "summaKeyWords": [
            "firmware",
            "content downloaded",
            "onscreen touch turning",
            "speedy",
            "author",
            "simple",
            "nst",
            "page turn rate",
            "non",
            "sideloading",
            "sideloaded",
            "like",
            "project",
            "update",
            "updated",
            "current",
            "e",
            "battery life",
            "feels",
            "feel",
            "played",
            "flexible organization",
            "organize",
            "need",
            "lowered",
            "price",
            "needs perfectly",
            "added",
            "date",
            "sd card",
            "process",
            "cumbersome",
            "sitting",
            "gb micro",
            "problems",
            "wifi",
            "noticeable",
            "books",
            "book",
            "difference",
            "sort",
            "user interface",
            "cons",
            "version meets",
            "b",
            "seriously",
            "super",
            "metadata",
            "title",
            "pretty",
            "features",
            "pros",
            "places",
            "gutenburg",
            "majorly",
            "kindles",
            "latest",
            "november",
            "refresh",
            "physical"
        ],
        "sentiment": 0.9906
    },
    "119": {
        "overall": 1,
        "asin": "140053271X",
        "reviewerName": "Bob Noble",
        "reviewText": "Here's my take on NST:  This is a very nice, but very limited reader.  I LOVE THE DISPLAY.  That's it.  A real home run?  Not quite...\n\nQuick summary is that they won't sell me any other unit with an LCD (I spend all day looking at one of those, I don't want another one for my fun-reading).  I might as well use my netbook or go all the way to a real tablet, and that won't be from B+N.\n\nHere are the problems with the whole Nook thing.\n\n(1) You can't use it for a PDF, magazine, or anything with graphics because YOU CANNOT ZOOM OR ROTATE. I have purchased some books with pictures and figures that you can't see.  Guess they want you to get the color tablet-like Nook, huh?  Nope, not going there (see above).\n\n(2) YOU CANNOT SHARE BOOKS. Yeah, yeah, they SAY you can, but that's VERY LIMITED and makes no sense.  (If the publishers trust them enough with their DRM to have the book at all, why can't you transfer the book to someone else using the same DRM?) I can get a paperback, read it, and share it forever.  Not so with Nook and you know it.\n\n(3) B+N (and everybody's) E-BOOKS COST THE SAME AS A NEW PAPERBACK, even though the seller didn't incur any cost of printing, shipping, inventory, etc.  But I can get a paperback for 25% off at my local Kroger grocery store for new releases and best sellers, or I can go down to the used book stores and find quite a few titles at 50% (or more) off list.  When everybody in my family has read that book, I can sell it to the used book store for 15% or 25% of list value.  That's a win-win.\n\nSo, where's the advantage with a Nook other than it's cool?  Three strikes (it could get one more if you count fragility compared to a paperback book).  This whole e-reader thing is bravo-sierra at this point.\n\nThat's my $0.02.  Just wish I had known this before I spent the hundred dollars.",
        "summary": "In baseball, with 3 strikes, you'd be out",
        "unixReviewTime": 1332720000,
        "vote": 5.0,
        "index": 119,
        "summaKeyWords": [
            "nook",
            "thing",
            "nope",
            "tablet",
            "huh",
            "reader",
            "color",
            "limited",
            "e",
            "stores",
            "kroger grocery store",
            "real home",
            "local",
            "run",
            "books",
            "book",
            "yeah",
            "cost",
            "share",
            "paperback read",
            "releases",
            "fun",
            "new",
            "win",
            "fragility",
            "shipping",
            "summary",
            "best",
            "day looking",
            "bravo",
            "publishers trust",
            "list",
            "pdf",
            "seller",
            "sellers",
            "value",
            "magazine",
            "b"
        ],
        "sentiment": 0.9627
    },
    "120": {
        "overall": 1,
        "asin": "140053271X",
        "reviewerName": "k_tree",
        "reviewText": "I bought this Nook Simple Touch on Amazon.com, but when I received it, the WiFi would not connect. I tried my home network as well as several WiFi hot spots around town. Barnes & Noble Customer Service was NO HELP, telling me that, since I did not purchase the Nook Simple Touch from B&N, they could not help me, and suggesting that I needed to return it to the seller. I did return it, thinking it was damaged somehow, and the seller graciously gave me a full refund with no argument (kudos to him and Amazon!).\n\nLater, I bought one from B&N, and it had the same problem. Again, B&N Customer Service was NO HELP, but did send a replacement. The replacement has the SAME PROBLEM and will NOT CONNECT to WiFi. Now, I'm arguing with B&N for a full refund.\n\nMost of the reviews are glowing. But what they don't say is that B&N has this WiFi connectivity problem very commonly with the Nook Simple Touch. Even the B&N Forum has many references to the problem.\n\nI'm not saying that you should not buy one of these Nook Simple Touches, and maybe you will not have the same problem. Just beware.\n\nCAVEAT EMPTOR!",
        "summary": "Nook Simple Touch has WiFi Connection Problems",
        "unixReviewTime": 1330732800,
        "vote": 22.0,
        "index": 120,
        "summaKeyWords": [
            "simple",
            "touch",
            "touches",
            "nook",
            "home network",
            "arguing",
            "amazon",
            "connect",
            "connectivity",
            "wifi",
            "caveat",
            "hot spots",
            "later",
            "graciously gave",
            "problem",
            "argument",
            "kudos",
            "customer",
            "beware",
            "emptor",
            "seller",
            "barnes",
            "noble",
            "town",
            "service"
        ],
        "sentiment": -0.9739
    },
    "121": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "adi",
        "reviewText": "I was pretty doubtful about whether an ebook reader was worth it, but this nook surpassed my expectations. I love the simplicity, and the small size makes it perfect for travelling. The material its made of makes it stay in your hand well, and the features it has is just right for me - not to fancy, but not lacking either. My only complaint is the fact that you can't use the dictionary on pdf books, but I remedied that easily by using software on my computer to convert my pdfs into epub before putting them on the nook. All in all, this is the best purchase I've made in a while - definitely worth it!",
        "summary": "fantastic!",
        "unixReviewTime": 1329782400,
        "vote": null,
        "index": 121,
        "summaKeyWords": [
            "pretty doubtful",
            "worth",
            "definitely",
            "small size makes",
            "ebook reader",
            "books",
            "pdf",
            "best purchase"
        ],
        "sentiment": 0.9872
    },
    "122": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Ben Nowak",
        "reviewText": "I must admit I was a skeptic regarding ebooks. I thought nothing could beat a good ole paperback in my hand. after purchasing 2 of these for my wife and I on a whim I have to admit, I love it.\n\nAllows me to read books more quickly,not sure why, faster page turning, easier to find where you left off, maybe easier to read for longer periods of time, easier to carry with you anywhere maybe?.\n\nAdjustable font size so you don't have to squint at small print, display is just like a real page, and you can flip pages with a swipe, a touch, or using the buttons on either side. I can't compare it to a Kindle because I never owned one, but my understanding is that it allows more formats than the kindle does.\n\nso simple to transfer books from my computer, or purchase books via WIFI at B&N or at home, or even borrow from my local library online!\n\ncan't say enough great things about it, my wife and I were thrilled with them, not really any cons, wifi is difficult to connect in some places, thats pretty much it",
        "summary": "Great product, revolutionary",
        "unixReviewTime": 1328918400,
        "vote": null,
        "index": 122,
        "summaKeyWords": [
            "good ole paperback",
            "read books",
            "print display",
            "faster page",
            "flip pages",
            "turning easier",
            "small",
            "transfer",
            "purchasing",
            "purchase",
            "great things",
            "maybe",
            "adjustable font size",
            "longer periods",
            "local library",
            "thats",
            "cons",
            "wifi",
            "real",
            "time",
            "online"
        ],
        "sentiment": 0.8844
    },
    "123": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Nikki",
        "reviewText": "I tried to leave this review at barnesandnoble.com, but they never posted it. Oh well.\n\nThe Nook Simple Touch is a great e-reader. If you are looking for a tablet like device to surf the internet and check email, this is not the product for you. The e-ink screen is amazing. It looks like you are reading a physical book. I like that you can turn the page by pressing the buttons or touching the side of the screen. Either way will be useful depending on how you are holding the book. This is very simple, which I love. One night, I was lying down in bed and went to lay the Nook on it's side then immediately jerked it back up before the page orientation changed. Then I remembered that it won't do that; which makes this great for reading no matter what position you may be sitting or lying in.\n\nThe Nook accepts epub books; which means that you can get books from a variety of stores, not just Barnes & Noble. I found that between the B&N store and Google Books, you can get all of the classics for free. No reason to pay for one of those ever again. Download Adobe Digital Editions to put books on from other places; including borrowed books from the public library.\n\nThe Nook doesn't handle pdf's well on its own, but there is a work around. Download Calibre, bring your pdf's into it and then convert them into epubs. Once you do that, you will be able to highlight and take notes like you can with the actual books.\n\nIf you want a simple e-reader, the Nook Simple Touch is the best. (FYI: It's costs less on the B&N website.)",
        "summary": "Great e-reader!",
        "unixReviewTime": 1328832000,
        "vote": null,
        "index": 123,
        "summaKeyWords": [
            "barnesandnoble",
            "pdf",
            "handle",
            "useful depending",
            "orientation",
            "tablet like device",
            "digital",
            "download",
            "adobe",
            "public",
            "library",
            "noble",
            "barnes",
            "calibre bring",
            "best",
            "fyi",
            "page",
            "changed",
            "notes",
            "looking",
            "looks",
            "editions",
            "immediately jerked",
            "b store",
            "stores",
            "website",
            "email",
            "check",
            "book",
            "books",
            "e",
            "simple",
            "epubs",
            "accepts epub",
            "nook",
            "places including borrowed",
            "actual"
        ],
        "sentiment": 0.9927
    },
    "124": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "G",
        "reviewText": "price: nook - cheaper or same price as kindle with ads.\nscreen: nook (barely) - same screen nook software makes slightly better typeface.\nnon-drm ebook format: nook - supports more popular epub vs kindle support of mobi.\nother document formats: kindle - supports .doc, .txt, & .rtf; nook doesn't.\nborrowing from library support: nook - better for now, but popularity of kindles and Amazon marketing may change that, time will tell if libraries start purchasing kindle only ebooks.\nother paid book sources: nook - can read books purchased from other ebooks stores like google, sony, etc. kindle can't.\nuser interface: nook\nbells & whistles: kindle - text to speech is incredibly helpful for dyslexics and others. plays mp3s. x-ray is pretty cool.\nconnectivity: kindle - for an additional $50 you can get a kindle with 3G.\npage turns: nook - slightly faster.",
        "summary": "nook touch vs kindle touch",
        "unixReviewTime": 1327968000,
        "vote": 3.0,
        "index": 124,
        "summaKeyWords": [
            "nook",
            "kindle",
            "kindles",
            "format",
            "formats",
            "supports",
            "support",
            "ebooks",
            "read books purchased",
            "paid book",
            "google",
            "software makes slightly better",
            "non ebook",
            "cool",
            "incredibly helpful",
            "amazon marketing",
            "x",
            "mp",
            "plays",
            "stores like",
            "libraries start purchasing",
            "interface",
            "screen",
            "connectivity",
            "turns",
            "typeface",
            "txt",
            "popular epub vs",
            "sources",
            "doc",
            "rtf",
            "library",
            "whistles",
            "bells",
            "g page",
            "sony",
            "pretty",
            "popularity",
            "user",
            "ads"
        ],
        "sentiment": 0.9851
    },
    "125": {
        "overall": 1,
        "asin": "140053271X",
        "reviewerName": "C",
        "reviewText": "I enjoyed the original Nook. I thought this would be a great device, especially since it received such positive responses from reviewers on several sites.\n\nI've had the Nook (3 of them, actually) and am returning it before my 14 day window is up.\n\nFirst, the buttons are annoying to use. I like having the option to tap the screen, but I'd rather keep it as clean and clear as possible. Simply hard to press the buttons down. They don't seem to be getting any easier after finishing a book.\n\nSecond, and most importantly, is the contrast and quality of the screen. Different letters are darker than others on every page, within words, and they change every time I go to the next page and back. I thought it might have just been something weird with the files, or formatting, so I played around and did the troubleshooting. Nope. It's just horrible to look at.\n\nAfter having 3 with the same problem, I'm going to just send it back. No need to go through that cycle and then be stuck dealing with the awful customer service. It's too bad; I really wanted to support Barnes and Noble by using their reader.\n\nNote: I put this review on the B&N site, and they removed it for somehow violating their terms. Well, okay then.",
        "summary": "Poor screen quality and service",
        "unixReviewTime": 1327881600,
        "vote": 10.0,
        "index": 125,
        "summaKeyWords": [
            "original",
            "nook",
            "device especially",
            "going",
            "stuck dealing",
            "support",
            "barnes",
            "book",
            "second",
            "great",
            "troubleshooting",
            "nope",
            "different letters",
            "day window",
            "reader",
            "note",
            "simply hard",
            "awful customer",
            "screen",
            "possible",
            "service"
        ],
        "sentiment": 0.9554
    },
    "126": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "S. Blackin",
        "reviewText": "it is really good and portable i can take it when i go to Florida. though it does not have a back light, i truely enjoy it.",
        "summary": "AWESOME",
        "unixReviewTime": 1326844800,
        "vote": null,
        "index": 126,
        "summaKeyWords": [
            "truely"
        ],
        "sentiment": 0.7501
    },
    "127": {
        "overall": 2,
        "asin": "140053271X",
        "reviewerName": "Microdev",
        "reviewText": "The device physically, is relatively good for the money.  There are many reviews on YouTube and other places that address that point.  The problem with the B&N system is the fact that you must enter a 'default credit card' to be able to use or purchase any books.  If you were to buy this Nook for your young son or daughter, they would be able to purchase anything at the flick of a finger, and it would charge to your credit card 'for your convenience'.  Similarly, if anyone found your child's Nook, they too could purchase anything using your credit card information.\n\nI tried get creative and purchased a gift card for my child but although this can create a credit on the child's account, B&N still requires a credit card to be on-file in order to 'unlock' the book.  By contrast, with the Kindle system, you simply buy a book through Amazon using any credit card (which does not have to stay active) and send it to an authorized device.  The Nook system, by comparison, is slow, clunky, and a massive security risk.\n\nIf you setup the Nook and do not provide this credit card during setup, no books can be sent to the Nook wirelessly, they must be sync'ed with a cable tethered to a computer.  Since my 12 year-old daughter purchased this herself with her own money, I have no choice but to either tell her to eat the unit or use my credit card without any parental control.  Furthermore, it would appear that B&N is entering into a contract with my minor daughter in this regard.  By opting out of this model, you are left with an utterly useless device.\n\nWhy none of the other reviewers elaborate on this is beyond me.  I suppose if the device is owned by an adult this model would work, however if you are contemplating this as a gift for your child, I'd avoid any device related to B&N altogether.\n\nI give them 2 starts for the hardware only but otherwise the device, in this case, is useless.  While you can delete your credit card from B&N, the process is well hidden and you would need to add a card, order, download, sync, unlock, and then delete the card in order to get each purchase on the device.  Either that or hand your child your Visa and tell them to enjoy!  Now that's what I call convenience.",
        "summary": "The device is okay, but the book service is not",
        "unixReviewTime": 1326499200,
        "vote": 3.0,
        "index": 127,
        "summaKeyWords": [
            "device",
            "related",
            "utterly useless",
            "relatively good",
            "physically",
            "authorized",
            "reviewers elaborate",
            "reviews",
            "control",
            "similarly",
            "convenience",
            "parental",
            "furthermore",
            "nook",
            "wirelessly",
            "clunky",
            "slow",
            "avoid",
            "b",
            "card",
            "massive security",
            "sync",
            "simply",
            "buy",
            "risk",
            "account",
            "altogether",
            "download",
            "order",
            "default credit",
            "young son",
            "daughter",
            "gift",
            "information",
            "unlock",
            "year",
            "purchase",
            "purchased"
        ],
        "sentiment": 0.9844
    },
    "128": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Poacherd",
        "reviewText": "I choose this product because it's capable of support diferent formats, I convert my pdf files in EPUB whit free programs (calibre and sigil) and mi readings are now easy and the graphics are visualized correctly.",
        "summary": "Excelent Product",
        "unixReviewTime": 1326153600,
        "vote": 2.0,
        "index": 128,
        "summaKeyWords": [
            "support diferent",
            "formats",
            "epub whit free programs",
            "mi readings",
            "calibre",
            "pdf files"
        ],
        "sentiment": 0.8885
    },
    "129": {
        "overall": 2,
        "asin": "140053271X",
        "reviewerName": "Ananke",
        "reviewText": "I bought three of these. I was very very happy of the performance with the original 1.0.1 firmware. However, two of them already upgraded to the 1.1.0 firmware, which immediately erased the ability to use the \"look\" functions as internet browser.\n\nOne of the readers frost during update and it doesn't recognize the \"nook\" menu button anymore...I will return it, luckily it is within the original retail return period.\nThe second reader seems OK. It is less responsive now though, after the \"upgrade\"...Will test it with imported through Callibre books tonight, if it is still OK after firmware update.\nThe third reader hasn't updated yet, I don't know why. I will return it anyway - I don't want to take the risk.\n\nConclusion: B&N completely ruined otherwise not bad reader by buggy and restrictive firmware update. It is definitely not worth the money right now.\n\nI have the first generation Nook too, and in general I preferred Nook due to the epub support. I integrated with Callibre and used embedded fonts for non-Latin epub books.\n\nI promoted my Nook readers to friends until this firmware update, because of the OK hardware and epub support. However, considering that B&N is much less popular than its competitor, and popularity means software and application support, and it has no text or Word doc files support, and being extremely restrictive in order to not allow direct internet access to competitive or free content, I am strongly NOT RECOMMENDING purchase of the device. It is OK if given free for a brand new unit.",
        "summary": "Latest firmware is a bust",
        "unixReviewTime": 1325548800,
        "vote": 2.0,
        "index": 129,
        "summaKeyWords": [
            "readers",
            "reader",
            "internet",
            "firmware",
            "support",
            "epub",
            "free",
            "nook menu button",
            "conclusion",
            "return",
            "restrictive",
            "brand new",
            "callibre books",
            "retail",
            "original",
            "immediately erased",
            "b completely ruined",
            "popularity means software",
            "recommending purchase",
            "look functions",
            "ok",
            "hardware",
            "money right",
            "embedded fonts",
            "word doc files",
            "allow direct",
            "unit",
            "content",
            "given",
            "popular",
            "risk",
            "browser",
            "access",
            "period",
            "extremely",
            "anymore",
            "non",
            "update",
            "updated",
            "tonight"
        ],
        "sentiment": 0.9944
    },
    "130": {
        "overall": 2,
        "asin": "140053271X",
        "reviewerName": "Valueminded",
        "reviewText": "I bought the Nook Touch instead of the Kindle because it was on sale for $75, which is still alot to pay for something that can only be used to read books. I didn't realize that if you buy books from B&N, you can only read them on your Nook, and not on anything else.  So even though you paid for them, those books really aren't your property.  You have no access to them if you don't use their products! Still, I liked the fact that it used ePub, and you had a variety of stores you could buy from and also that libraries have more ePub books available.  However, I just heard that their latest firmware update prevents you from reading any books except those bought from B&N. If I had known this I never would have bought the Nook. It's as consumer un-friendly as you can get!  Really a nasty way to do business.  Amazon is different.  Once you buy a book, it is yours.  You can read it on any device. When it comes to buying books, Amazon is far easier to use and alot more consumer friendly.  The Kindle is by far a better choice of the two.\nI am returning the Nook after only a week, because this is a frustrating product that doesn't function like it is supposed to do.  There are simply too many glitches in how the touch screen works to be reliable. Here are the cons:  First, it often takes multiple touches to access anything.  You touch or swipe the screen, and nothing happens.  You try it again, and still nothing.  What a joke.  Second, pages turn mysteriously on their own and without warning, both forward and backward.  I am always losing my place when I try to read a book.  I've noticed that this happens almost every time you alter the angle of the Nook.  If you're reclining and turn to adjust the pillow, don't expect to return back to the same page you were on.  Third, the pop-up menu and dictionary are too easy to activate by accident.  If you hold the Nook too close to the screen, or at the top or bottom, the pop-up menu will appear or the dictionary will activate unintentionally.  This happens several times an hour.  You can't just simply sit down, relax and read unless you sit motionless in a chair and hold it on your lap. Last of all, it does not use a standard USB\/micro USB cable. The USB connection to the computer is standard, but the micro USB connection to the Nook itself is NOT!  It is thinner and wider.  You can only use the cord provided with the Nook to connect to your computer to transfer files or charge the batteries.  You can't use the standard USB cord that works with all of your other electronic gadgets, like your digital camera or your portable hard drive.  So if you need a longer cord, or lose their cord, you're out of luck. Talk about a major inconvenience, one that makes zero sense!  Pros: I did like that it recharges in under 4 hours and that it has a very long battery life.",
        "summary": "Not consumer friendly, full of glitches",
        "unixReviewTime": 1325203200,
        "vote": 3.0,
        "index": 130,
        "summaKeyWords": [
            "touch instead",
            "takes multiple touches",
            "screen works",
            "books",
            "book",
            "nook",
            "amazon",
            "read",
            "epub",
            "reading",
            "buy",
            "buying",
            "available",
            "business",
            "inconvenience",
            "major",
            "digital camera",
            "better choice",
            "far easier",
            "batteries",
            "portable hard",
            "gadgets",
            "liked",
            "transfer files",
            "noticed",
            "long battery",
            "page",
            "luck",
            "talk",
            "function like",
            "second pages turn mysteriously",
            "drive",
            "usb",
            "b",
            "friendly",
            "consumer",
            "life",
            "electronic",
            "nasty way",
            "joke",
            "frustrating product",
            "products",
            "activate",
            "unintentionally",
            "cord provided",
            "latest firmware update prevents",
            "micro",
            "cable",
            "standard",
            "connection",
            "connect"
        ],
        "sentiment": -0.8067
    },
    "131": {
        "overall": 3,
        "asin": "140053271X",
        "reviewerName": "Cesar Hernandez Gt",
        "reviewText": "(I'm writing my review in amazon because B&N \"Block\" my review arguinf  it  violates the Terms of Use of B&N... Ironic don't you think :\/, anyway this is my original review of the ebook Reader)\n\nThe readers is fine in general:\n\nPros:\n- Nice physically materials\n- Best Graphic User Interface than Kindle\n- Nice e-ink screen\n- Great speed of screen refreshing\n- Touch screen response is wonderful\n\nCons:\n- Physically buttons for Back and Forward are kind of hard To press\n\n- No Landscape Mode... I don't understand why :(\n\n- No Web Browser or RSS reader app or something like that\n\n- PDF reader usually do not render properly if the pdf has Tables, Bullets, Images and other graphic different from text.\n\n- You Can Not Delete, move or rename Files from the device User Interface, you always have to connect it to the computer to do this actions... this makes you waist a lot of time.\n\n- The device has a hidden partition used to store the books you purchased at B&N store. You cannot have access to that partition (with or without computer) in order to delete this purchased books.\n\n- You can not export your Highlight or Notes from the books. Kindle is a step forward with this \"most have\" feature.\n\n- The reader does not have the option to Lock the screen with a secret password or Dots combinations like Android phoness. Remember that you have stored your credit card inside the account of the device!!\n\n- The Home screen lacks the options for fold or expand the 3 sections: Reading now, library and Next Readings.",
        "summary": "Nice hardware but a software with lack of features",
        "unixReviewTime": 1324166400,
        "vote": 2.0,
        "index": 131,
        "summaKeyWords": [
            "writing",
            "reader",
            "readers",
            "review",
            "hidden partition",
            "b",
            "store",
            "stored",
            "block",
            "ironic",
            "original",
            "arguinf",
            "forward",
            "step",
            "app",
            "rss",
            "pdf",
            "ebook",
            "usually",
            "web",
            "browser",
            "mode",
            "landscape",
            "credit card inside",
            "sections",
            "reading",
            "readings",
            "phoness",
            "like",
            "android",
            "dots combinations",
            "files",
            "rename",
            "secret password",
            "remember",
            "render properly",
            "bullets",
            "tables",
            "images",
            "user",
            "graphic",
            "nice physically materials",
            "e screen",
            "cons",
            "best",
            "books",
            "kindle",
            "pros",
            "interface",
            "device",
            "buttons",
            "different",
            "great",
            "wonderful"
        ],
        "sentiment": 0.9731
    },
    "132": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Emma L",
        "reviewText": "I have had my nook simple touch for a few weeks now- I previously owned a Sony Reader pocket edition, and I own a iPad. This device fills a niche- if you want to annotate pdf documents or watch movies or any of those other things, get a tablet or the iPad or the kindle fire. This device is designed to read books, and it does a beautiful job at it. I purchased my Sony reader expecting to be able to add comments in it, but it was way too difficult, and ultimately I decided to purchase an iPad. Like the Sony reader, the nook can take notes but wouldn't be a great device to purchase for that purpose.\nIt was pretty easy to set up- I didn't read the instruction manual, but I usually don't. I just followed the on screen instructions to connect it with my internet, my barnes and noble account, and then plugged it into my computer to sync it with library books. I had a bit of trouble connecting it with my internet, but that has happened with every new device I've purchased, so I think its my internet's fault, not the nook. I went through the steps a few times and then it started worked.\nI really like holding it to read- I generally read ridiculously thick books, so its nice to have something small and light to hold instead of a massive book that I have to prop up (and its so much nicer to read from than an iPad- the iPad is fine to read from, and i never seemed to feel screen fatigue, but it is way too heavy to hold with one hand). Initially I didn't realize that the two buttons on either side of the screen move the page forward or back, so I was touching the screen each time- the delay time is a bit longer that way, and it was annoying to have to use both hands. As soon as I realized that the buttons existed, the experience got even better.\nThe battery life seems great- I charged it all the way up using my usb-to-outlet power adapter that I have for my iphone\/ipad, and it worked great. I haven't had to charge it again, and I've been reading for about an hour each day.\nThe one thing that surprised me and was frustrating for a few minutes was when I realized that I couldn't load my other epub books onto the nook because there wasn't enough room. The advertised size of the nook is 2gb, which is a ton of books, but it wasn't enough room for the books I've acquired through other sources- like google book downloads. A quick google search solved this problem- barnes and noble appropriates the majority of this space for content you purchase directly from barnes and noble. Fortunately there is an easy solution- there is a slot for a microSD card, and I happened to have a 2gb one lying around- plus they only cost about $5, if that. I popped it in, turned the device off and on, and I was ready to go again. Not a deal-killer by any means, but something to consider if you're planning to add your own epub library to your nook.\nKindle vs. Nook- I haven't owned a kindle, only used it for a few minutes, but my personal opinion as I decided which to purchase was this: price was important (and I got a great black friday deal on the nook), and since they were about the same price I wanted to support the more open epub format, since you can load books from other sources. Yes, its possible to convert epub to kindle format but its an extra step that many people won't be interested in. I would have purchased the kindle with special offers, and hadn't thought much about it, but I've enjoyed the pictures of authors that show up on my nook screen, and would probably get annoyed by the commercials\/make a point to put my nook in a case so I didn't have to see them.\nDurability- I haven't abused it by any stretch of the imagination- yet- but it did take a fall off a coffee table and didn't crack\/break\/show any sort of damage\nI'll update my review as I have more time to play with it in the next few months",
        "summary": "Great purchase- you won't regret it",
        "unixReviewTime": 1323388800,
        "vote": 5.0,
        "index": 132,
        "summaKeyWords": [
            "books",
            "book",
            "epub",
            "noble",
            "like",
            "google",
            "great",
            "reader pocket",
            "screen instructions",
            "read",
            "reading",
            "nook simple",
            "kindle",
            "purchased",
            "purchase",
            "deal",
            "power adapter",
            "pretty easy",
            "device fills",
            "worked",
            "instruction",
            "sources",
            "holding",
            "ipad",
            "black friday",
            "search",
            "bit",
            "longer",
            "offers",
            "beautiful job",
            "add comments",
            "experience got",
            "special",
            "update",
            "problem",
            "steps",
            "times",
            "time",
            "delay",
            "extra step",
            "barnes",
            "card",
            "annotate pdf documents",
            "battery life",
            "buttons",
            "microsd",
            "won",
            "connect",
            "trouble connecting",
            "crack",
            "existed",
            "personal opinion",
            "people",
            "commercials",
            "watch movies",
            "page forward",
            "hand",
            "hands",
            "initially",
            "advertised size",
            "coffee table",
            "previously owned",
            "library",
            "vs",
            "format",
            "hold instead",
            "solution",
            "account",
            "fortunately",
            "appropriates",
            "directly",
            "edition",
            "acquired",
            "enjoyed",
            "expecting",
            "sony",
            "started",
            "new",
            "manual",
            "yes",
            "iphone"
        ],
        "sentiment": 0.9609
    },
    "133": {
        "overall": 1,
        "asin": "140053271X",
        "reviewerName": "E. Leung",
        "reviewText": "I have had my Nook for over a year now and I think it is a great ereader. HOWEVER DO NOT buy your content from Barnes and Noble. In the first few months I had it I purchased about 30 books using their awesome click to buy feature. Then back in February, I thought I lost my credit card and cancelled it. I hadn't yet updated my new card on Barnes and Noble's site when I went to reread a book I had purchased months before. IT WOULD NOT DOWNLOAD. I called support and was told that their policy requires an active credit card to access books I have already paid for. This policy creates a lot of the problems.\n1) I don't feel the books are mine. I paid for them. I should have full access to them.\n2) If I buy a reader for one of my kids, they could download books and I wouldn't know until I got a bill (gift cards do not qualify as an active credit card) and B & N has a strict no refund policy on ebooks.\n3) Requiring me to keep I credit card on file should be an invasion of my privacy.\n4) What happens if I replace my Nook with a non-B & N reader? I lose all content purchased.\n\nDO NOT make the same mistake I did. Do not purchase Nookbooks from Barnes & Noble. Adobe Digital Editions allows you to \"unlock\" .epub files for download to your Nook and a good alternative for \"permanent\" access to your material is to purchase ebooks from [...].",
        "summary": "PLEASE READ BEFORE PURCHASE",
        "unixReviewTime": 1322524800,
        "vote": 67.0,
        "index": 133,
        "summaKeyWords": [
            "ereader",
            "great",
            "feature",
            "buy",
            "called support",
            "epub files",
            "access",
            "books",
            "book",
            "file",
            "unlock",
            "b",
            "n",
            "noble",
            "adobe",
            "digital",
            "purchased",
            "purchase",
            "awesome click",
            "editions allows",
            "download",
            "permanent",
            "non",
            "reader",
            "policy requires",
            "barnes",
            "ebooks",
            "requiring",
            "good alternative",
            "nookbooks",
            "months",
            "creates",
            "refund",
            "content"
        ],
        "sentiment": 0.9609
    },
    "134": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "The Big Pill",
        "reviewText": "Having previously owned a Kindle, I was not expecting that e-book readers had much improved over the last year. Contrast on the display was a big problem for me, and I wasn't especially keen that the Kindle uses a proprietary book format that cannot be read on other e-readers. So, as long as I stuck buying books from Amazon for a Kindle, I was fine; the second I ever wanted to move to another device, I couldn't take my books. This didn't sit well with me.\n\nWhen Barnes and Noble dropped the price of the Nook Simple Touch to $99 I decided to take the plunge. (Note that as of this writing, Amazon still has not reflected the price drop.) The newer generation screen, while still not perfect, is far, far superior than earlier generations. Reading indoors no longer requires a spotlight on the e-reader to maintain legibility. Anyone who owns an iPad or other tablet knows how intuitive a touch interface can be, so I'm delighted to say that the navigation issues previously posed by the joystick on the older Kindle are resolved with the Nook's new touch interface.\n\nAmazon released their own Touch e-reader just recently. While it now brings the Kindle in line with the capabilities of the Nook, it still lags in one area: proprietary book format. The Nook and all other major e-readers use EPUB, a now-standard file format for e-books. Amazon for its own reasons chooses not to. What this means in practical terms is that you pretty much have to buy all of your books from Amazon - and forget about taking them with you if you ever decide another e-reader is the better platform for you.\n\nI refuse to be a party to that kind of lock-in, which is why I am very happy with my Nook Simple Touch.",
        "summary": "A Very Pleasant Surprise",
        "unixReviewTime": 1321401600,
        "vote": 13.0,
        "index": 134,
        "summaKeyWords": [
            "generations",
            "amazon",
            "touch",
            "proprietary book format",
            "e readers",
            "drop",
            "newer generation",
            "uses",
            "use",
            "stuck buying books",
            "previously owned",
            "read",
            "noble dropped",
            "kindle",
            "file",
            "simple",
            "especially keen",
            "year",
            "practical terms",
            "contrast",
            "longer requires",
            "delighted",
            "better platform",
            "big problem",
            "reasons chooses",
            "maintain",
            "legibility",
            "tablet knows",
            "plunge",
            "note",
            "buy",
            "navigation issues",
            "reading indoors",
            "interface",
            "price",
            "posed",
            "owns",
            "earlier",
            "screen",
            "older",
            "nook",
            "area"
        ],
        "sentiment": 0.9519
    },
    "135": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Anand",
        "reviewText": "New Nook eReader is definitely better than Kindle.\n* Expandable storage slot\n* Excellent support for open book formats\n* Touch screen\n* Even smaller and compact.\n\nIf you are OK with 6 to 8 hours of battery, go for Nook Color and root it. Refurbished ones costs 150-170$. It is an excellent choice in-between eReaders and Android tablets.\n\nKindle 3G option is attractive for a tablet, but not an eReader.",
        "summary": "New Nook is well worth the wait",
        "unixReviewTime": 1315699200,
        "vote": 2.0,
        "index": 135,
        "summaKeyWords": [
            "nook",
            "color",
            "new",
            "ereader",
            "ereaders",
            "open book formats",
            "touch screen",
            "refurbished ones costs",
            "definitely better",
            "kindle",
            "excellent support",
            "expandable storage slot",
            "tablets",
            "tablet",
            "g"
        ],
        "sentiment": 0.8825
    },
    "136": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Wally",
        "reviewText": "I know Amazon is going to hate me for this but here goes:\n\nI used to have a Kindle 3. It was great. It made reading a pleasure however there were a couple of things I would have liked to change. I wished that it had a touch screen and that it was smaller.\n\nWhen I saw the Nook Touch I thought that this is what my Kindle should be like. Well I decided to buy the Nook and I'm very, very pleased. I won't go into an in depth review of the device itself. You can find that just about anywhere. What I will say is the touch screen makes things so much easier. I love the on screen virtual keyboard (like the ipad) and the fact that it's a lot smaller than the Kindle 3 but with the same size and quality screen.\n\nSince giving the Kindle to a relative I thought about the books that I already bought from Amazon and the fact that I now have to use my Android phone to read them since the Nook does not read Kindle books......or does it??\n\nWith a little research I was able to find out how to root my Nook Touch (voids your warranty). Now when I turn on the Nook, it gives me a dual boot screen (sort of). I can go to the Android desktop or the the Nook screen. Using the Android desktop which included the Android market I downloaded the Kindle reading app. I ran that app, logged into my Kindle account and now have all my Kindle book available on my Nook Touch. The only thing missing is text to speech but I didn't use that feature anyway. Yes it has a web browser, email and all the other Android apps available but most look pretty drab on a monochrome device. That isn't why I did this. I wanted a device to read my Nook Books and Kindle books.\n\nI now have the best of both worlds.",
        "summary": "Fantastic alternative to the Kindle",
        "unixReviewTime": 1315526400,
        "vote": 40.0,
        "index": 136,
        "summaKeyWords": [
            "know",
            "amazon",
            "look pretty drab",
            "browser email",
            "depth review",
            "little research",
            "web",
            "device",
            "monochrome",
            "smaller",
            "lot",
            "app",
            "apps",
            "kindle",
            "android phone",
            "reading",
            "read",
            "things",
            "thing missing",
            "touch screen",
            "makes",
            "account",
            "virtual keyboard",
            "market",
            "desktop",
            "books",
            "logged",
            "book available",
            "quality",
            "voids"
        ],
        "sentiment": 0.9951
    },
    "137": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "AngelAnn",
        "reviewText": "I am so pleased with my new Nook Touch. I have already purchased 4 books and am reading them all. The best part is that there are so many good books that are free ( even one OT\/NT free Bible)and most others are under $10. There is also the ability to read samples of books before you buy without going out of the house because the Nook has Wi-Fi.\nI really like everything about it, especially the fact that there is a battery that can be changed by B&N or by me after the warranty is out and the ability to visit B&N store for help.\nI would highly recommend.",
        "summary": "Super Great ebook Reader",
        "unixReviewTime": 1314662400,
        "vote": 3.0,
        "index": 137,
        "summaKeyWords": [
            "nook",
            "touch",
            "new",
            "books",
            "b",
            "purchased",
            "good",
            "visit",
            "store",
            "free",
            "read samples",
            "reading",
            "ot",
            "bible",
            "recommend",
            "highly"
        ],
        "sentiment": 0.9819
    },
    "138": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Jerry P. Danzig",
        "reviewText": "This is the third ebook reader I've used and definitely the best.  The Franklin eBookman had nice hardware but dreadful firmware with more bugs than you would find in a swamp in summer.  The Ectaco Jetbook Lite had a number of glitches in its firmware as well, plus an extremely user-unfriendly upgrade method.\n\nI did encounter one major problem with this Nook Simple Touch -- the life of a battery charge was nowhere near the several weeks promised (with wifi off).  Fortunately, however, I called B&N Customer Service, and they advised me to install the latest firmware, V1.0.1, which addresses the power issue.\n\nThe upgrade proceeded easily and without glitches, and it seems to have solved the problem; though I haven't put the duration of a battery charge to the full test yet, the charge indicator is holding at 100% after a full day, including more than an hour of reading.  That compares very favorably to the 83% discharge rate I had been experiencing in just three days using the old firmware.  I will report back if the battery problem returns.\n\nOtherwise I prefer the Nook Simple Touch's ergonomics to the comparable Kindle.  The Nook's front is all screen, with no unnecessary keyboard keys.  Virtual keyboard keys appear onscreen when you need to search for something.  The unit fits nicely in the back pocket of my jeans or shorts, and it's trim and lightweight.\n\nThere are convenient page turning buttons flanking the screen, making for easy one-handed operation in a subway.  You have a choice of font styles and sizes, and the screen is easy to read even under bright sunlight.  You can touch any word onscreen to get a quick dictionary definition (provided, I found, that the word isn't hyphenated and run on two lines).\n\nI like the ease with which you can download titles from the public library (you download to Adobe Digital Reader, which your library provides free, and then transfer the Epub books to your Nook with the USB cable provided).  The program recognized my Nook without any glitches.\n\nI also like being able to read any book for an hour a day FREE at the nearby B&N store.\n\nNewbies should note that, in their apparent effort to keep the NST instructions short and simple, B&N left out a few useful ones.  Notably: to close one book (so you can open another), press the Nook button below the screen (the thing that looks like an upside-down U) and enter \"library.\"  To lock the Nook immediately, without waiting for it to enter sleep mode, press the power button on the back briefly.  And to tell when the Nook has finished charging, wait for the little LED next to the USB input on the unit to turn from amber to green.\n\nSo if you have been looking for an ebook reader offering great value and ergonomics, take a look at this Nook.  But make sure to upgrade to firmware V1.0.1 or higher!)\n\nUPDATE: Trust me to find the bugs in an ebook reader -- or perhaps they find me.  At any rate, I bought a copy of the American Heart Association Cookbook (7th Edition) and was dismayed to see some of the fractions describing quantities in recipes replaced by question marks!\n\nI emailed B&N Customer Support, and they suggested that I try downloading the title again (which you do by archiving and unarchiving a title, whatever that means).  That didn't work, but I found that if I clicked the check box on the font selection screen marked \"Publisher's Default\" (or words to that effect), that seemed to solve the problem.  So if you're seeing question marks in any titles where numbers should be, try that solution!\n\nI sure love beta testing new products for these big companies -- NOT!",
        "summary": "The Right Touch",
        "unixReviewTime": 1314489600,
        "vote": 3.0,
        "index": 138,
        "summaKeyWords": [
            "b",
            "button",
            "provided",
            "provides",
            "battery charge",
            "customer",
            "marks",
            "marked",
            "dreadful firmware",
            "jetbook",
            "update",
            "ones",
            "library",
            "nook",
            "screen",
            "simple",
            "user upgrade",
            "keyboard",
            "charging wait",
            "keys",
            "th",
            "heart",
            "convenient page turning buttons",
            "digital",
            "major problem",
            "mode",
            "association",
            "cookbook",
            "word",
            "words",
            "ebook reader",
            "download titles",
            "try downloading",
            "days",
            "question",
            "unit fits nicely",
            "test",
            "store",
            "power",
            "sleep",
            "usb cable",
            "turn",
            "selection",
            "definitely",
            "free",
            "enter",
            "appear onscreen",
            "operation",
            "recipes replaced",
            "fractions describing quantities",
            "nst instructions short",
            "like",
            "little",
            "looks",
            "led",
            "looking",
            "look",
            "big companies",
            "compares",
            "discharge rate",
            "comparable",
            "bright",
            "sunlight",
            "program recognized",
            "check box",
            "kindle",
            "weeks promised",
            "apparent effort",
            "book",
            "epub books",
            "nice hardware",
            "ebookman",
            "franklin",
            "make sure",
            "love beta testing new products",
            "making",
            "offering great value",
            "virtual",
            "quick dictionary definition",
            "proceeded easily",
            "font styles",
            "day including",
            "lite",
            "ectaco",
            "shorts",
            "title",
            "higher",
            "trust",
            "useful",
            "notably",
            "american",
            "edition",
            "latest",
            "old",
            "v",
            "extremely",
            "adobe",
            "press",
            "isn",
            "returns",
            "input",
            "seeing",
            "method",
            "finished",
            "waiting"
        ],
        "sentiment": 0.9974
    },
    "139": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Gordon Ehrensing",
        "reviewText": "I've never been remotely interested in e-book readers, but I was stuck in Best Buy during a car installation for hours the other month and saw this device. It's just about the only time I've discovered something not by hype or searching for a product to fit my needs but by wandering upon it in an electronics store. After reading about the new reader for a few weeks, I decided to actually buy one.\n\nAt this point, I've found it to be a really excellent device and the only thing remotely \"tablet\" that's appealed to my needs. I find it easy to use with one of the first touch screen keyboards that recognizes my non-dainty mitts (I kind of hate touch screens as a rule). I feel like the makers of this device understand how ADD our society has made us, and most complaints about the firmware's limited capacity to check e-mail, surf the web, and play tiny games are music to my ears. I just want electronic paper... for reading.\n\nSome bullet points about this e-reader, some of which stand it apart from competitors like the current Kindle:\n\n* 215 grams\n* No physical keyboard and low affinity of touch screen to oil\n* Battery life (obviously) - leave the wi-fi off\n* Maps true page numbers to print equivalent, should you cite or alternate between print and e-book\n* Supports non-proprietary formats that can be downloaded from Project Gutenberg, torrent sites, etc.\n* E-book library lending\n\nIt's one of the last things I mentioned, but the high compatibility of formats on the Nook is absolutely indispensable to me. I would never purchase a reader that required payment for content, just like I wouldn't mail publishers a check every time I borrowed a library book or a novel from a friend. Use your own morals. A big thanks to B&N for producing an intelligent device.",
        "summary": "Early opinion - owned for two weeks",
        "unixReviewTime": 1314403200,
        "vote": 3.0,
        "index": 139,
        "summaKeyWords": [
            "device",
            "electronics",
            "e",
            "book",
            "mail",
            "non",
            "kindle",
            "buy",
            "readers",
            "reader",
            "want electronic",
            "remotely interested",
            "gutenberg torrent",
            "obviously",
            "keyboard",
            "touch screen keyboards",
            "battery life",
            "screens",
            "feel like",
            "library",
            "required payment",
            "play tiny games",
            "bullet points",
            "point",
            "print",
            "discovered",
            "low affinity",
            "equivalent",
            "maps true page numbers",
            "limited capacity",
            "wi",
            "b",
            "car installation",
            "absolutely indispensable",
            "high compatibility",
            "big thanks",
            "friend",
            "use",
            "supports",
            "current",
            "grams",
            "competitors",
            "actually",
            "best",
            "project",
            "sites",
            "understand",
            "excellent",
            "intelligent",
            "store",
            "paper",
            "thing",
            "tablet",
            "things",
            "leave",
            "hate"
        ],
        "sentiment": 0.9882
    },
    "140": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Kindle Customer",
        "reviewText": "In full disclosure this is the first e-ink reader I have ever owned.  That being said, I've heard complaints from others about older models and have people at work compare their kindles to my nook touch and they think mine is sweet.  For me the size is perfect and once you play around with it, it is very easy to navigate.  It only has wi fi and no 3G but that may not matter to some.  I'm very happy with it so far and my only real complaint is that the B&N accessories are a little on the high side.  I mean really, you're paying 140 bucks for the reader, you shouldn't have to shell out $30 for a case.  Other than that, I think it's really cool and it doesn't have any of the web browser\/mp3 nonsense on it that sucks anyway on e readers.  If you're on the fence regarding e readers, go with this one and help keep book stores alive!!!",
        "summary": "An amazing one-function e-reader",
        "unixReviewTime": 1314057600,
        "vote": 3.0,
        "index": 140,
        "summaKeyWords": [
            "e reader",
            "readers",
            "browser nonsense",
            "web",
            "real complaint",
            "heard complaints",
            "b accessories",
            "book stores",
            "work compare",
            "alive",
            "older models",
            "paying",
            "bucks",
            "fi"
        ],
        "sentiment": 0.9134
    },
    "141": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Martin Omander",
        "reviewText": "This is a great and simple eBook reader. It's light enough that I can hold it in one hand when reading, it's small enough that it's easy to take with me, the battery life is long enough that I forgot where I put the charger, and the screen lets me read for hours on end without eye strain. It does one thing and does it well. Get a tablet computer (I am partial to the Toshiba Thrive) if you want to play games, do email, browse the web, do video conferencing, etc.",
        "summary": "Great no-frills eBook reader",
        "unixReviewTime": 1313971200,
        "vote": 2.0,
        "index": 141,
        "summaKeyWords": [
            "ebook",
            "simple",
            "reader",
            "toshiba",
            "thrive",
            "screen lets",
            "email browse",
            "strain",
            "eye",
            "play",
            "games",
            "video",
            "conferencing"
        ],
        "sentiment": 0.9343
    },
    "142": {
        "overall": 3,
        "asin": "140053271X",
        "reviewerName": "bvksg",
        "reviewText": "I bought this from B & N and had to return it back in June and they have still not credited me for the return.  I have called them at least ten times over the past two months and have been on the phone at least two to thee hours each time and they have still not credited me yet for the nook touch.  I am now forced to report it to my credit card company and hopefully they can get some where with them.  Buyer beware where you buy your Nook touch.",
        "summary": "Good unit terrible customer servi. 3",
        "unixReviewTime": 1313539200,
        "vote": null,
        "index": 142,
        "summaKeyWords": [
            "n",
            "b",
            "buyer beware",
            "thee hours",
            "nook",
            "touch",
            "card"
        ],
        "sentiment": -0.2311
    },
    "143": {
        "overall": 2,
        "asin": "140053271X",
        "reviewerName": "azezal",
        "reviewText": "For what I wanted it to do, namely display some of the pdf files and books that I already have on hand, this does a pretty poor job of it. The default software is not compatible with many would-be useful formats such as txt or rtf. There is no folder view for displaying the books you put on it, you are constrained to a library view that tries to sort everything for you. The settings page is a joke, there is almost no customization to be had there. The shop's main view was nonfunctional out of the box; every time I tried to access it, it kicked me back out to the main page, and I had to access it by going to the \"top 100\" page instead, and even then the search would sometimes not work. The battery capacity went down 20% over 4 days, so I don't think that it would make the 2 month mark that it should have.\n\nFor all of it's failings, it gets much better once it is rooted, as underneath it all, it is still an android 2.1 device. Once that happens, you have access to the android market, email, web browser, and more importantly, you can get apps that are better than the default nook book reader. You can even put amazon's android kindle reader on it as well.\n\nThe reason for the relatively low rating is that all of these features and functionality should have been unlocked by default. The default software that comes with it feels unfinished and lacking in features to me, and it seems like B&N were just being lazy when putting it together. Rooting it is also a pain, and even though there are some rough edges in a fully unlocked android OS on an eink interface, I still think that it is better than the default software. I would rate this as 4\/5 if it came unlocked by default.",
        "summary": "The software that it comes with is lackluster",
        "unixReviewTime": 1313193600,
        "vote": 5.0,
        "index": 143,
        "summaKeyWords": [
            "pdf files",
            "useful formats",
            "pretty poor job",
            "month mark",
            "rough edges",
            "android",
            "b",
            "interface",
            "eink",
            "relatively low rating",
            "unlocked",
            "settings page",
            "main",
            "folder view",
            "rate",
            "like",
            "nook book",
            "books",
            "reader",
            "kindle",
            "market",
            "email web",
            "battery capacity went",
            "default software",
            "instead",
            "library",
            "fully",
            "came"
        ],
        "sentiment": 0.8479
    },
    "144": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "mrsjrb",
        "reviewText": "I have owned my nook for two months now and am very happy with it.  My mom owns a Kindle, one sister a Nook Color, another sister a 1st Edition Nook...so I've seen my fair share of e-readers.  I did the research before I bought.  I actually bought my dad a Kindle 3G for Father's Day.  But the light weight of the Nook Touch was great for me.  I have problems with my hands and their abilities, so after a full day of commuting, typing, and writing, they've reached their peak.  It was the right choice for me.",
        "summary": "Very Happy",
        "unixReviewTime": 1311724800,
        "vote": 6.0,
        "index": 144,
        "summaKeyWords": [
            "fair share",
            "nook",
            "edition",
            "mom owns",
            "owned",
            "light weight",
            "color",
            "st",
            "touch",
            "reached",
            "seen",
            "bought",
            "actually",
            "right choice",
            "typing",
            "commuting",
            "g"
        ],
        "sentiment": 0.8734
    },
    "145": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "cacalazani",
        "reviewText": "I purchased the Kindle (Wi-Fi) and the original Nook (the B&W one) and tried them out during the return period. While there were things about the Kindle I really liked (features that other reviewers on the Kindle site had written), the one thing that made me choose the Nook was the ability to borrow and read ebooks from my local library. Haven't been back to the library since!\n\nNow here comes the Nook Simple Touch Reader (Nook STR). I got one via pre-order when they came out in early June.  It has the same e-ink Pearl screen as the Kindle, so the screen contrast is no longer an issue. And wow, has the user interface improved over the original Nook! (which I thought was clunky) The entire e-ink Pearl screen has full touchscreen capability. On both the Kindle and the original Nook, I felt myself wanting to touch the screen to select a book to read, instead of using the buttons (on the Kindle) or the LCD touchscreen (on the original Nook) to highlight and select the desired ebook. On the Nook STR, the Library screen shows icons for all the ebooks loaded in the device (both library and purchased). Touch the icon, and the ebook opens. Turning the page? Touch the screen on the right side of the page (to go forward) or the left side (to go back). Or swipe your finger across the screen as in flipping a physical book page. Or use the buttons built into the frame. Want to page quickly through a book? Hold down the page turning button. Need a word definition? Touch and hold on the word and a dictionary pops up. The user interface resembles that of an iPhone or iPad, with the icons, virtual keyboard and the physical home button. It even has the \"slide to unlock\" feature like the iPhone. The touchscreen on the Nook STR is infrared (it senses the heat of your finger, again like iPhone), so a light touch works just fine. I found that on the original Nook, sometimes it would take multiple touches on the LCD screen for the device to recognize a command.\n\nIn response to the reviews about the touchscreen ceasing to respond, the pre-order Nook STR I had suffered from that problem.  The touchscreen would become slow to respond, and eventually quit working altogether.  A power cycle generally brought it back.  I started a thread on B&N's website about this and found many others having the problem.  I did take my Nook STR back to B&N and they exchanged it.  Have had the replacement Nook ST for six weeks now and the problem hasn't returned.  So don't be spooked about buying one due to this problem - if it happens to you, exchange it.\n\nGoing back to library books, I had to install Adobe Digital Editions onto my PC (my library had the link to download - free).  This software allows you to manage your ebooks on your Nook.\n\nThe Nook STR is a good choice for seniors that may not have extensive computer skills.  Using the device is easy enough, but loading books from a library website (via Adobe Digital Editions) requires a few steps to complete.  If help is needed, it can be a positive relationship-building experience.\n\nOne last plus - once you get your Nook STR, check the \"Shop\" tab to access B&Ns website.  Every Friday B&N offers a free book for download, and has discounts on other days of the week.",
        "summary": "Simple (To Use) Touch Reader",
        "unixReviewTime": 1311465600,
        "vote": 593.0,
        "index": 145,
        "summaKeyWords": [
            "touch",
            "touches",
            "nook",
            "b",
            "book",
            "books",
            "library",
            "buttons",
            "button",
            "ebook",
            "page",
            "touchscreen",
            "pearl screen",
            "works",
            "read ebooks",
            "kindle",
            "wi",
            "relationship",
            "features",
            "liked",
            "turning",
            "editions",
            "adobe",
            "digital",
            "e",
            "user interface improved",
            "unlock feature like",
            "eventually quit working",
            "icon",
            "str",
            "return",
            "returned",
            "period",
            "shop tab",
            "early",
            "problem",
            "hasn",
            "june",
            "wanting",
            "want",
            "software allows",
            "frame",
            "power cycle generally brought",
            "good choice",
            "dictionary pops",
            "shows icons",
            "definition",
            "free",
            "lcd",
            "website",
            "home",
            "simple",
            "reader",
            "opens",
            "physical",
            "virtual keyboard",
            "loaded",
            "loading",
            "site",
            "positive",
            "experience",
            "iphone",
            "resembles",
            "requires",
            "install",
            "entire",
            "offers",
            "capability",
            "ceasing",
            "check",
            "pre",
            "instead",
            "word",
            "friday",
            "access",
            "download",
            "altogether",
            "original",
            "replacement",
            "st"
        ],
        "sentiment": 0.9788
    },
    "146": {
        "overall": 4,
        "asin": "140053271X",
        "reviewerName": "R S H",
        "reviewText": "Its a good ereader.  How it compares to the kindle, I dunno I seen raves and complaints for both.\nFor an ereader I love the nook.\n- battery life is awesome.  would be nice if this was solar powered like calculators.\n- the display looks great, even in direct sunlight more or less.\n- The simple touch looks cool, very simplistic. no buttons all touchscreen for the most part.\n- The extra $40 warrenty guarentees replacement of damaged nook.\n  covers anytype of damage from what I understand.\n- Not as many CCNA\/cisco books in epub as kindle but the list is growing fast.\n- No adds\n\nwhat I don't like;\n- only comes with 200mb of internal memory.  You have to pick up a microSD card\n- Cant delete files or books, there is simply no option for it. Im hoping for a patch.\n  which means you have to plug it in usb and delete stuff from your desktop.\n  Its very annoying.\n\nWhat Id like to see;\n- new screensavers for download\n- better support for PDF files\n- ability to read word doc\n- solar power, geez why not it only makes sense.",
        "summary": "No delete options??",
        "unixReviewTime": 1310860800,
        "vote": 3.0,
        "index": 146,
        "summaKeyWords": [
            "ereader",
            "good",
            "new screensavers",
            "solar powered like",
            "ccna books",
            "makes",
            "sense",
            "microsd card",
            "power geez",
            "nook",
            "read word doc",
            "memory",
            "internal",
            "direct sunlight",
            "im hoping",
            "display looks",
            "warrenty guarentees replacement",
            "calculators",
            "id",
            "covers anytype",
            "battery life",
            "growing",
            "fast",
            "seen raves",
            "simple touch",
            "extra",
            "better support",
            "damaged",
            "damage",
            "cool",
            "great"
        ],
        "sentiment": 0.9578
    },
    "147": {
        "overall": 3,
        "asin": "140053271X",
        "reviewerName": "H. Charlotte",
        "reviewText": "Just a short review of my two weeks with the Nook Simple Touch.  This looked the the reader to get when it came out.  Specifically for me the touch screen was a must.  I enjoyed reading on it everyday until I returned it.  It was light and extremely easy to navigate with its touch screen.  What happened though, was on about the 12th day while using it the touch screen stopped responding.  I couldn't turn a page with the screen or pull up a menu with the screen or do anything else.  And, when I shut it off and turned it back on I couldn't swipe the screen to get into the book - I was completely stuck...locked out.  Finally after fiddling with it after about 15 minutes it started to work again.  I went on the web and found out that others had this same thing happen to them so I decided to return it rather then hope for a fix (I was still within my 14 days return policy).",
        "summary": "Good reader, has some problems.",
        "unixReviewTime": 1310774400,
        "vote": 301.0,
        "index": 147,
        "summaKeyWords": [
            "short review",
            "stuck",
            "completely",
            "extremely easy",
            "enjoyed reading",
            "returned",
            "return",
            "days",
            "thing happen",
            "happened",
            "th day",
            "policy",
            "simple",
            "touch",
            "screen"
        ],
        "sentiment": 0.8173
    },
    "148": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Nu Mantra",
        "reviewText": "Let me start off by saying that I am a fan of Amazon.com. In the past month alone, I have made at least 12 purchases.  I was browsing around just now and decided to see what Amazon.com customers thought of my newest electronic device.  I was thrilled to see the high rating, but disappointed to see the price; $40.00 more than the thing costs at B\/N since its release last month.  Amazon, you need to do better here!\n\nNow to the product - This is my first e-reader and I am certain that I went with the best product for me.  As someone who buys a lot of books from Amazon, I would have preferred to have bought the Kindle,especially since Amazon has more of the types of books I read and for much cheaper than B\/N, but I just do not appreciate those tiny buttons on the device.  I absolutely LOVE my Nook Simple Touch, and I use it for several hours every day.  B\/N has Free Fridays - when you can download a featured book for free -, book share -with contacts on your device and social networks, and free reading of selected books when you are in B\/N.  My understanding is that I can go to local libraries and even borrow my books using my Nook; This may or may not be any special news.\n\nThe touch screen is a bit sensitive on the device, so if you prefer not to use it, they are also tactile \"buttons\" that will allow you to change pages.  The home screen shows the book you are currently reading and the page number you are on - a few other books in your library, and some suggested readings.  You can create shelves that you name on which to house your books by categories. They do not look like physical shelves, rather they are just a grouping of books.\n\nWithout going into more technical stuff that you can read online, I will say that if you are new to e-reading and you enjoy touch screens -  AND YOU ARE LOOKING FOR A PRODUCT THAT SIMPLY ALLOWS YOU TO READ - Do not hesitate to go into a B\/N and try this out.  Some people buy this expecting it to browse the web (although it does have a hidden browser that the techies are working to hack) - Play their audio files, when there is not headphone jack (Techies have discovered that it DOES have built-in bluetooth, however), and folks buy this and complain that they do not like how it does not display their magazines in color.  It is not meant to do that - it is meant to be solely an enjoyable easy-to-use reading device that does not give you a whole lot of options to be distracted from the task at hand, READING!\n\nThis is why I bought it - Eventually, I will get a nook color - or a Kindle *color* if they come out with one, but for now, I thoroughly  enjoy my Nook, which has encouraged me to slow down and spend so much more time in the peaceful, leisurely act of reading. In my excitement, I am reading like 8 different books at once.  That is the great joy of having an e-reader - speaking to those who are, just as I used to be, resistant to the e-reading craze - there is no more lugging around a bag filled with books, and when I get tired of reading one, another book is just a couple of swipes away. I am learning about how to get all sorts of books for free or low cost, as well as learning how to take advantage of conversion and e-book management tools such as Calibre.  I am having a blast with this thing!\n\nYesterday, I received a nice leather case for it that I purchased off Ebay for a great price.  Once again, I looked to Amazon.com first, but there simply were not good options.  I got a black leather Caseen case that also came with a screen protector for twenty bucks.",
        "summary": "Really, Amazon? It only costs $139.00 at  B\/N!",
        "unixReviewTime": 1310601600,
        "vote": 58.0,
        "index": 148,
        "summaKeyWords": [
            "read",
            "reading",
            "readings",
            "books",
            "book",
            "screen",
            "screens",
            "enjoy",
            "enjoyable",
            "touch",
            "b",
            "pages",
            "buys",
            "like physical",
            "free",
            "e",
            "cost",
            "thing costs",
            "nice leather case",
            "kindle",
            "amazon",
            "headphone jack",
            "tiny buttons",
            "great joy",
            "page number",
            "people buy",
            "color",
            "nook",
            "simple",
            "love",
            "high",
            "rating",
            "library",
            "bit sensitive",
            "local libraries",
            "bag filled",
            "absolutely",
            "simply",
            "files",
            "peaceful leisurely act",
            "social",
            "networks",
            "news",
            "audio",
            "away",
            "good",
            "allow",
            "technical stuff",
            "allows",
            "hidden browser",
            "options",
            "swipes",
            "play",
            "hack",
            "special",
            "best",
            "product",
            "device",
            "caseen",
            "past month",
            "customers thought",
            "different",
            "create shelves",
            "newest electronic",
            "management tools",
            "day",
            "techies",
            "price",
            "tactile",
            "change",
            "folks",
            "low",
            "yesterday",
            "easy",
            "thoroughly",
            "protector",
            "shows",
            "home",
            "speaking",
            "black"
        ],
        "sentiment": 0.9978
    },
    "149": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "David L. Williams",
        "reviewText": "First let me qualify my comments.  If you are looking for an all purpose ePad or IPAD alternative, buy another product!  That's clearly not what Barnes and Noble designed this unit for.  It's not intended to surf the web, check email, etc.  It is an eReader...PERIOD!\n\nHaving said that, in my opinion, it is the best out there right now.  It is incredibly light weight - much lighter than even a typical paperback.  It is easy on the eyes for extended reading periods and can be read in basically every lighting situation you could read a real book.  The clarity is sharp but not overpowering on the eyes like an LCD type display is after a few hours.\n\nThe battery life is insane.  If you turn off WIFI, which should be normal unless you are looking for another book, the battery doesn't need recharging for weeks on end.  Page turning is a simple touch to the left or right of the screen.  Assignable buttons are also provided for pagination but they require a rather firm press.  I found most of the time I don't use them.\n\nIt has a very responsive touch screen for all your navigation.  I had a 1st generation Nook and this one is far easier to navigate through books which is a big plus for Bibles or Reference books.  It reads ePub format so more than half of what I read comes from the public library.\n\nIt is not going to be great for color magazines and so on.  You will need a Nook Color or an ePad like Xoom or IPAD for that.  But the downside with those is that the LCD type display cannot be read in direct sunlight so good luck at the beach or pool.\n\nOne nice feature I use now and then is the dictionary.  If you come across a word you are unfamiliar with you just touch it and up pops an option look it up.  I think Barnes and Noble has a winner here.",
        "summary": "Great eReader in Every Respect",
        "unixReviewTime": 1310515200,
        "vote": 4.0,
        "index": 149,
        "summaKeyWords": [
            "option look",
            "looking",
            "like",
            "big plus",
            "epad",
            "book",
            "books",
            "firm",
            "press",
            "think",
            "barnes",
            "far easier",
            "noble designed",
            "read",
            "reads",
            "direct sunlight",
            "nook",
            "purpose",
            "eyes",
            "xoom",
            "real",
            "reference",
            "color magazines",
            "st generation",
            "web check",
            "need recharging",
            "extended reading periods",
            "nice feature",
            "simple touch",
            "screen",
            "lighting situation",
            "page turning",
            "typical",
            "paperback",
            "incredibly light weight",
            "assignable buttons",
            "email",
            "epub format",
            "alternative buy",
            "end",
            "turn",
            "responsive",
            "ereader",
            "comes",
            "come",
            "ipad",
            "type",
            "library"
        ],
        "sentiment": 0.9935
    },
    "150": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Happy Jester",
        "reviewText": "Let just start off by saying that I have tried the Kindle and although an OK hardware device, the interface was terrible.  It felt like the early days of the internet, with textual interfaces, underlined words, fiddling with buttons and keyboard to navigate, and all sorts of annoyances that got in the way of reading and enjoying the device. We returned it within 3 days.\n\nNext we tried the original Nook Black&White, and interface was much better, but the screen had poor contrast. (not the nice Pearl screen as the Kindle has)\n\nEnter Nook Touch.  WOW.  This thing has a top notch interface... they totally put their minds and heart into this one...  it is PERFECT.  Touchscreen makes a world of a difference, and enables the slick interface that allows you to browse the store, personal library, and more.  On-screen Buttons and finger gestures make the magic happen, and this is one device you are sure to LOVE TO USE.  The screen is the new Pearl, so it looks just as good as the Kindle, with the added benefit of touchscreen!\n\nThe size?  PERFECT!  Not too big, not too small.  Very thin.  Well built.  Feels durable.\n\nAll I can say is this is finally the ereader I've been waiting for...  excellent battery life, good Pearl screen, touchscreen, and perfect size.\n\nTo boot, the price is dead on!  $139 with Wifi.  If it gets stolen, I am buying another one immediately!",
        "summary": "A real pleasure to use this device!  Finally!",
        "unixReviewTime": 1310428800,
        "vote": 5.0,
        "index": 150,
        "summaKeyWords": [
            "ok hardware",
            "device",
            "feels",
            "happen",
            "magic",
            "durable",
            "built",
            "contrast",
            "poor",
            "stolen",
            "gets",
            "interface",
            "added benefit",
            "early days",
            "interfaces underlined",
            "store personal",
            "pearl",
            "felt like",
            "words fiddling",
            "library",
            "screen",
            "touchscreen makes",
            "slick",
            "textual",
            "notch",
            "perfect",
            "good",
            "life",
            "finger gestures make",
            "excellent battery",
            "nook",
            "size",
            "buttons",
            "nice",
            "new",
            "black"
        ],
        "sentiment": 0.995
    },
    "151": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Willie",
        "reviewText": "Barnes and Noble hit one out of the park with this ereader! compact, great e-ink infrared touch screen, microsd card slot, two-month battery life, wifi, support for pdf and epub, and best of all, running Android!\n\nthe STR has already been rooted, and handily runs Android and a host of goodie apps - but even if you don't want to crack your unit, you'll still enjoy a nice ereader and simple-to-use interface:\n\n- fast, responsive, and crystal clear screen - even in sunlight\n- touch right or left sides of screen to page forwards or backwards - OR - use the hardware buttons on the top sides of the frame\n- use 'shelves' to organize your titles\n- view titles as icons or in a list\n- insert bookmarks, notes\n- look up words instantly with its built-in dictionary\n- change fonts, font sizes on the fly\n- purchase titles via wifi or copy from your computer\n- and much more...\n\nno ereader is perfect, but this one comes close; i held off buying one until the market provided lots of choices - and the STR is the one i've been waiting for!\n\nbtw, if you have an ereader, you should also get the free cross-platform ebook app, calibre - it is an *essential* ereader companion, and can be used to convert DRM-free ebooks to nearly any format for nearly all ereaders, include the new Nook Simple Touch!",
        "summary": "The STR is flying off the shelves!",
        "unixReviewTime": 1310169600,
        "vote": 4.0,
        "index": 151,
        "summaKeyWords": [
            "ereader",
            "use",
            "ereaders include",
            "apps",
            "app",
            "running",
            "e infrared touch",
            "free",
            "purchase",
            "titles",
            "battery",
            "insert",
            "drm ebooks",
            "bookmarks notes",
            "screen microsd card",
            "fast",
            "life",
            "cross ebook",
            "interface",
            "handily runs",
            "nook",
            "simple",
            "compact great",
            "noble hit",
            "market provided lots",
            "comes",
            "close",
            "page forwards",
            "hardware buttons",
            "words instantly",
            "left sides",
            "wifi support",
            "crystal clear",
            "fonts font",
            "change",
            "android",
            "fly",
            "view",
            "list",
            "look",
            "responsive",
            "shelves",
            "frame",
            "slot",
            "new",
            "convert",
            "companion"
        ],
        "sentiment": 0.9866
    },
    "152": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "Mercedes",
        "reviewText": "I've had all the other Nook's and this is the first that I truly love.  The touch screen is accurate and quick, there is no reflection at all, page turns are quicker than the other Nooks.  It's very light, the archiving and rating process is much much easier.  Shopping is easier as well.  I'm in love with my Kindle and always compared the Nook, now I love them equally.  Of all the Nooks, I think this is the best one, I love it.  I only wish it was 3g.  Barnes and Noble still seems to have an issue with the syncing of books between the readers.  When I read on this Nook (just like the other 2), it doesn't sync with online so when I then use my Iphone I'm not at my current page.  In this area, the Kindle and Amazon know what they are doing.  I'm not terribly impressed with the choice of covers for this new Nook.  I'm waiting patiently for M-Edge to release their new covers so that I can use my M-Edge light with both my Nook and Kindle.",
        "summary": "Love this Nook",
        "unixReviewTime": 1309996800,
        "vote": 2.0,
        "index": 152,
        "summaKeyWords": [
            "new",
            "covers",
            "nook",
            "nooks",
            "rating process",
            "love",
            "truly",
            "page turns",
            "barnes",
            "g",
            "touch screen",
            "easier",
            "shopping",
            "current",
            "m",
            "waiting patiently",
            "terribly impressed"
        ],
        "sentiment": 0.9903
    },
    "153": {
        "overall": 5,
        "asin": "140053271X",
        "reviewerName": "John Braun",
        "reviewText": "The device itself is amazing...\n\n-great TOUCHSCREEN interface\n-perfect reading screen\n-clean looking design, small because there is no keyboard to make it bigger and it's smaller than the original Nook\n-reads formats natively that the Kindle won't\n-read all the ebooks you want in B&N stores for free\n-library checkouts are easy\n-press and hold on a word to get its definition\n-highlight and take notes in a book easily\n\n...but when you ROOT the thing it gets even better!\n\n-Install the Gmail app to get your mail\n-get the Opera browser (supports Flash!)\n-install the Kindle app and you can read Kindle ebooks too\n-Put it in host mode to attach an external keyboard\n-Make sure to get the Home Button Savior app so you can switch back and forth between the B&N reader and the rest of the device's functionality.\n\nI used these instructions:\n\n[Amazon removed my link.  Google \"Root Nook Touch Using TouchNooter & Install Go Launcher, NookColor Tools, Gmail, Market & YouTube\", it's the top link. ]\n\nI will be buying LOTS of these as gifts, and I'm going to root them all!  This is a perfect device for hackers and regular ebook readers too!\n\nWhat's a Kindle?  Never heard of it.",
        "summary": "Root it and it's even better!",
        "unixReviewTime": 1309824000,
        "vote": 307.0,
        "index": 153,
        "summaKeyWords": [
            "read",
            "nook",
            "kindle",
            "install",
            "reads formats",
            "perfect reading screen",
            "ebooks",
            "gmail app",
            "keyboard",
            "make",
            "ebook readers",
            "great",
            "supports",
            "nookcolor",
            "google",
            "amazon removed",
            "library checkouts",
            "flash",
            "button",
            "market",
            "clean looking",
            "tools",
            "touchscreen interface",
            "root",
            "reader",
            "press",
            "book easily",
            "definition",
            "easy",
            "lots",
            "highlight",
            "going",
            "buying",
            "host mode",
            "savior",
            "opera browser",
            "design small",
            "free",
            "instructions",
            "sure",
            "external",
            "amazing",
            "better",
            "touchnooter",
            "launcher",
            "link",
            "home",
            "b stores"
        ],
        "sentiment": 0.9858
    }
}